[
  {
    "id": 37,
    "title": "Các mẫu câu đi trễ, về sớm thường gặp chốn công sở",
    "a_href": "https://tienganhtflat.com/blog/cac-mu-cau-i-tr-v-sm-thng-gp-chn-cong-s",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/late-f6a22ec8f0-18770f97f844182c823fa20314bc59b1.png",
    "viewer": "39,744",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><h2 style=\"font-style:italic\"><span style=\"color:#B22222\">NẾU BẠN LÀ SẾP:</span></h2><p>- Running late this morning?<br/><em>(Sáng nay cậu đi muộn à?)</em></p><p>- What held you up this morning?<br/><em>(Sáng nay cậu làm gì mà đến muộn thế?)</em></p><p>- Do you have a reason for being late?<br/><em>(Cậu có một lý do cho việc đến muộn không?)</em></p><p>- Why are you late?<br/><em>(Tại sao cậu lại đến muộn thế?)</em></p><p>- You have been late three times in the last two weeks. Is this going to be a continual problem?<br/><em>(Cậu đã đến muộn 3 lần trong hai tuần qua. Vấn đề này sẽ tiếp tục tái diễn phải không?)</em></p><p>- Your tardiness is getting out of hand. You had better start managing your morning time better.<br/><em>(Cậu đang không kiểm soát được việc bản thân đến muộn. Câu nên bắt đầu quản lý thời gian buổi sáng của mình tốt hơn.)</em></p><p>- I expect you to be at your desk at eight o'clock. Do you have a problem with this?<br/><em>(Tôi hy vọng cậu có mặt tại bàn làm việc vào lúc 8 giờ. Cậu có gặp vấn đề gì với điều này không?)</em></p><p style=\"text-align:center\"><em><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20%C4%91i%20l%C3%A0m/late.png?1477463693899\"/></em></p><h2 style=\"font-style:italic\"><span style=\"color:#B22222\">ĐI MUỘN 5 PHÚT</span></h2><p>- \"Sorry I'm late. Traffic was unusually bad today.\"<br/><em>(Xin lỗi tôi đến muộn. Hôm nay giao thông tệ quá)</em></p><p>- \"I apologize for being late. I had to drop off my wife at work. It took longer than I thought.\"<br/><em>(Tôi xin lỗi vì đến muộn. Tôi phải đưa vợ tôi đi làm. Việc đó tốn nhiều thời gian hơn tôi nghĩ.)</em></p><p>- I had a dentist appointment this morning and it was longer than I expected<br/><em>(Sáng nay tôi đã có hẹn với nha sĩ và việc đó lâu hơn tôi mong đợi)</em></p><p>- I'm sorry for being date. I got stuck in every light this morning.<br/><em>(Tôi xin lỗi vì đến muộn. Sáng nay tôi toàn gặp đèn đỏ)</em></p><h2 style=\"font-style:italic\"><span style=\"color:#B22222\">CÁCH XIN LỖI SẾP</span></h2><p>- I am terribly sorry. It won't happen again<br/>\n(Tôi thật sự xin lỗi. Điều đó sẽ không xãy ra nữa đâu)</p><p>- I had a lot of recent changes at home, but it's all taken care of. I will not be late again<br/>\n(Gần đây ở nhà tôi đã có rất nhiều thay đổi, nhưng tất cả đều được lo ổn thỏa rồi. Tôi sẽ không đi làm muộn nữa)</p><p>- I'm really sorry. It's been one of those weeks. It won't happen again<br/>\n(Tôi thật sự xin lỗi. Đây quả là một tuần tồi tệ. Điều đó sẽ không xãy ra lần nữa đâu)</p><h2 style=\"font-style:italic\"><span style=\"color:#B22222\">ĐI RẤT MUỘN</span></h2><p>- Hi Ben, I'm going to be 30 minutes late today. My car is having trouble this morning, so I arranged for a ride with a friend.<br/><em>(Chào Ben, hôm nay tôi sẽ đến muộn 30 phút. Sáng nay chiếc xe của tôi bị trục trặc, nên tôi đã phải sắp xếp để đi cùng một người bạn.)</em></p><p>- Hey Jack, I am running a little late today. I just got out of my dentist appointment and it was longger than I expected.<br/><em>(Chào Jack, hôm nay tôi sẽ đến muộn một chút. Tôi vừa kết thúc cuộc hẹn với nha sĩ và nó kéo dài lâu hơn là tôi mong đợi)</em></p><p>- Mark? This is Pat. I am stuck in traffic. I think there is an accident that is holding up traffic. I am going to be a little late.<br/><em>(Mark hả? Pat đây. Tôi bị tắc đường. Tôi nghĩ đã có một tai nạn đang làm tắt nghẽn giao thông. Tôi sẽ đến muộn một chút.</em></p><p>- I have a doctor's appointment tomorrow morning. Remember I told you earlier this week? I'll come in right after my appointment.<br/><em>(Sáng mai tôi có cuộc hẹn với bác sĩ. Bạn có nhớ tôi đã nói với bạn vào đầu tuần này không? Tôi sẽ đến ngay sau cuộc hẹn đó.)</em></p><p>- My daughter has been sick, so I'm going to take her to see the doctor tomorrow morning. Is it ok if I'm a little late?<br/><em>(Con gái tôi bị ốm, nên sáng mai tôi sẽ dẫn con bé đi gặp bác sĩ. Liệu tôi có thể đến muộn một chút được không?)</em></p><p>- I have to take my parents to the airport tomorrow. I shouldn't be too late, but wanted to tell you ahead of time.<br/><em>(Ngày mai tôi phải đưa ba mẹ tôi ra sân bay. Tôi sẽ không đến quá muộn, nhưng tôi vẫn muốn nói với bạn trước.)</em></p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20%C4%91i%20l%C3%A0m/man_late_for_work_racing_the_clock_0521-1012-0921-2451_SMU.jpg?1477463757940\"/></p><h2 style=\"font-style:italic\"><span style=\"color:#B22222\">XIN VỀ SỚM</span></h2><p>- I have to leave a little early today. Is it ok if I finish my work at home?<br/><em>(Hôm nay tôi phải về sớm một chút. Tôi có thể hoàn thành công việc của mình ở nhà không?)</em></p><p>- I have a dentist appointment at four. I have to leave early today.<br/><em>(Tôi có một cuộc hẹn với nha sĩ vào lúc 4 giờ. Hôm nay tôi phải về sớm một chút)</em></p><p>- I have a dentist appointment tomorrow at four. Is it ok if I leave early tomorrow?<br/><em>(Tôi có một cuộc hẹn với nha sĩ vào lúc 4 giờ ngày mai. Vậy ngày mai tôi về sớm có được không?)</em></p><p>- I have to pick up my wife at the airport tomorrow. Is it ok if I leave at three?<br/><em>(Ngày mai tôi phải đón vợ tôi tại sân bay. Vậy tôi về lúc 3 giờ có được không?)</em></p><p>- I have a conference with my son's teacher tomorrow at three thirty. I have to leave at three. Will that be ok?<br/><em>(Tôi có một cuộc họp với giáo viên của con trai vào ngày mai lúc 3 rưỡi. Tôi phải về lúc 3 giờ. Liệu có được không?)</em></p><p>- I have a terrible headache. Is it ok if I leave early today?<br/><em>(Tôi bị đau đầu kinh khủng. Hôm nay tôi về sớm một chút có được không?)</em></p><p>- I think I might be coming down with the flu. I should get some rest and try to fight this thing off early. May I leave early today?<br/><em>(Tôi nghĩ tôi đang bị cúm. Tôi muốn nghỉ ngơi một chút và cố gắng chữa khỏi nó. Hôm nay tôi có thể về sớm không?)</em></p><p>- I'm not feeling well. I think I should get some rest. Will it be ok if I go home early today?<br/><em>(Tôi đang cảm thấy không khỏe. Tôi nghĩ tôi nên nghỉ ngơi một chút. Nếu hôm nay tôi về nhà sớm thì có được không?)</em></p><p>- My son got sick and I have to pick him up from school. Will that be ok?<br/><em>(Con trai tôi bị ốm và tôi phải đón thằng bé ở trường về. Tôi về sớm có được không?)</em></p><p> </p></div>",
    "page": 3
  },
  {
    "id": 38,
    "title": "Mẫu câu tiếng anh cho nhân viên thu ngân - bán hàng",
    "a_href": "https://tienganhtflat.com/blog/mu-cau-ting-anh-cho-nhan-vien-thu-ngan-ban-hang",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/14-87dea9200f-7b370017d05fc0efb28e67c0e587340b.jpg",
    "viewer": "4,505",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20%C4%91i%20l%C3%A0m/fdgb.png?1477468859808\"/></p><p><strong>- Do you have a discount card today?</strong>----&gt; Câu này dùng để hỏi khách hàng có mang theo phiếu giảm giá không.</p><p><strong>- Are you using any coupons today? </strong>----&gt; Hỏi về phiếu mua hàng.</p><p><strong>- I will need to see some ID to sell you a lottery ticket. (for age restricted items),</strong>----&gt; Xem chứng minh thư để là đăng ký rút thăm</p><p><strong>- I’m sorry but your card has been declined. Would you like to use another form of payment?</strong>  ----&gt; thông báo thẻ thanh toán bị từ chối và hỏi khách hàng có loại hình thanh toán nào khác không.</p><p><strong>- Will there be anything else for you today?</strong> ----&gt; Hỏi khách hàng có muốn mua gì nữa không</p><p><strong>- Is this everything today?</strong> ----&gt; Xác  nhận số lượng hàng đã chọn</p><p><strong>- And how was everything today? (service industry)</strong>, ----&gt; Hỏi thăm khách hàng</p><p><strong>- Will that be cash or charge?</strong> ----&gt;Thanh toán bằng tiền mặt hay ghi nợ vào tài khoản</p><p><strong>- How will you be paying today?</strong> ----&gt; hỏi về phương thức thanh toán</p><p><strong>- Your total comes to $16.50</strong>. ----&gt; Thông báo tổng tiền</p><p><strong>- From twenty…and here’s $3.50 change</strong>. ----&gt; Báo lại số tiền khách đã đưa và số tiền còn dư.</p><p><strong>- Please swipe your card.</strong> ----&gt; Yêu cầu quét thẻ.</p><p><strong>- I just need to see some photo ID to verify your check.</strong> ----&gt;Xem chứng minh thư để xác nhận séc</p><p>-<strong> Would you like your receipt in the bag?</strong> ----&gt; Hỏi khách hàng có muốn mình cho biên lai vào túi đựng hàng không.</p></div>",
    "page": 3
  },
  {
    "id": 39,
    "title": "NHỮNG MẪU CÂU TIẾNG ANH DÙNG TRONG SIÊU THỊ",
    "a_href": "https://tienganhtflat.com/blog/nhng-mu-cau-ting-anh-dung-trong-sieu-th",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/supermarket-ec80472161-d6e2c172bcade6cbd0f72deea419ebb4.png",
    "viewer": "2,708",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><h2 style=\"font-style:italic\"><strong>Finding and asking for items - Tìm và hỏi đồ cần mua</strong></h2><p><strong>1, Could you tell me where the ... is?                    anh/chị có thể chỉ cho tôi … ở đâu không?</strong></p><ul><li>milk                                                     chỗ bày sữa</li><li>bread counter                                       quầy bánh mì</li><li>meat section                                        quầy thịt</li><li>frozen food section                               quầy đông lạnh</li></ul><p><strong>2, Are you being served?                                     đã có ai phục vụ anh/chị chưa?</strong></p><p><strong>I'd like ...       </strong>                                                 tôi muốn mua …</p><ul><li><strong>that piece of cheese  </strong>                            mẩu pho mát kia</li><li><strong>a slice of pizza</strong>                                      một miếng pizza</li><li><strong>six slices of ham         </strong>                          sáu miếng thịt jăm bông</li><li><strong>some olives</strong>                                           một ít quả ô liu</li></ul><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/542722186.jpg?1477555113514\"/></p><p><strong>3, How much would you like?                                anh/chị cần mua bao nhiêu?</strong></p><ul><li><strong>300 grams</strong>                                             300g</li><li><strong>half a kilo  </strong>                                             nửa cân</li><li><strong>two pounds</strong>                                             2 pao (1 pao xấp xỉ bằng 450g)</li></ul><h2 style=\"font-style:italic\"><strong>At the checkout - Tại quầy thanh toán</strong></h2><p><strong>- That's £32.47  </strong>                                                      cái đó giá 32.47 bảng</p><p><strong>- Could I have a carrier bag, please?    </strong>                  cho tôi xin một chiếc túi đựng hàng được không?</p><p><strong>- Could I have another carrier bag, please? </strong>            cho tôi xin một chiếc túi đựng hàng nữa được không?</p><p><strong>- Do you need any help packing? </strong>                           anh/chị có cần giúp xếp đồ vào túi không?</p><p><strong>- Do you have a loyalty card?</strong>                                  anh/chị có thẻ khách hàng lâu năm không?</p><h2 style=\"font-style:italic; text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/animated-supermarket-image-0005.gif?1477555135399\"/></h2><h2 style=\"font-style:italic\"><strong>Things you might see - Các dòng chữ bạn có thể gặp</strong></h2><ul><li><strong>Checkout </strong>                                                 Quầy thanh toán</li><li><strong>8 items or less  </strong>                                        8 món đồ hoặc ít hơn</li><li><strong>Basket only</strong>                                               Dành riêng để rỏ đựng hàng</li><li><strong>Cash only</strong>                                                 Dành riêng cho thanh toán bằng tiền mặt</li><li><strong>Best before end  </strong>                                      Chất lượng đạt tốt nhất trước cuối tháng hoặc cuối năm nào đó</li><li><strong>Use by</strong>                                                      Sử dụng trước ngày nào đó</li></ul></div>",
    "page": 3
  },
  {
    "id": 40,
    "title": "THÀNH NGỮ DIỄN TẢ TÂM TRẠNG",
    "a_href": "https://tienganhtflat.com/blog/thanh-ng-din-t-tam-trng",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/fgdsfh-1d49538339-e5c39b21cf758a0169d93077284cd24f.png",
    "viewer": "4,630",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><h2 style=\"font-style:italic;\"><span style=\"color:#B22222\"><strong>Thành ngữ khi bạn hoàn toàn vui mừng!</strong></span></h2><ul><li><strong>over the moon:</strong> sung sướng vô cùng</li></ul><p>eg: He was over the moon when he heard the news. (Ông ấy đã sung sướng vô cùng khi nghe tin.)</p><ul><li><strong>thrilled to bits</strong>: rất hài lòng</li></ul><p>eg: She was thrilled to bits with her new bicycle. (Cô ấy rất hài lòng với chiếc xe đạp mới của mình.)</p><ul><li><strong>in seventh heaven</strong>: rất vui sướng</li></ul><p>eg: They were in seventh heaven when they learned they’d won a  cruise. (Họ đã rất vui sướng khi họ biết họ đã thắng được một cuộc đi chơi biển.)</p><ul><li><strong>on cloud nine</strong>: hạnh phúc như ở trên mây.</li></ul><p>eg: When I got the job, I was on cloud nine for several weeks. (Khi tôi có việc, tôi đã hạnh phúc như ở trên mây trong vài tuần.)</p><ul><li><strong>jump for joy</strong>: nhảy cẫng lên vì sung sướng.</li></ul><p>eg: We jumped for joy when we got the mortgage. (Chúng tôi đã nhảy cẫng lên vì sung sướng khi chúng tôi nhận được thế chấp.)</p><h2 style=\"font-style:italic;\"><strong><span style=\"color:#B22222\">Những thành ngữ diễn tả tâm trạng buồn</span></strong></h2><ul><li><strong>down in the dumps</strong>: buồn (chán); chán nản; thất vọng</li></ul><p>eg: When she left him, he was down in the dumps for a couple of weeks. (Khi cô ta rời bỏ anh ấy, anh đã rất buồn trong vài tuần lễ.)</p><ul><li><strong>feel blue:</strong> cảm thấy buồn</li></ul><p>eg: She felt a little blue when she lost her job. (Cô ấy cảm thấy hơn buồn khi mất việc.)</p><ul><li><strong>beside oneself (with grief, worry)</strong>: quá đau buồn</li></ul><p>eg: When her son went missing, she was beside herself with worry. (Khi con trai bà ấy bị mất tích, bà ấy đã quá đau buồn.)</p><h2 style=\"font-style:italic;\"><span style=\"color:#B22222\"><strong>Thành ngữ diễn tả tâm trạng bực bội</strong></span></h2><ul><li><strong>sick as a parrot:</strong> rất thất vọng</li></ul><p>eg: He was as sick as a parrot when he realised he had thrown away his lottery ticket. (Anh ấy rất thất vọng khi nhận ra rằng anh ấy đã vứt tờ vé số của mình.)</p><h2 style=\"font-style:italic;\"><span style=\"color:#B22222\"><strong>Thành ngữ có nghĩa là bạn đang rất tức giận.</strong></span></h2><ul><li><strong>see red</strong>: rất tức giận</li></ul><p>eg: Don’t talk to him about his boss – it just makes him see red! (Đừng nói chuyện với anh ta về ông chủ của anh ta – nó chỉ làm cho anh ta tức giận mà thôi!)</p><ul><li><strong>hopping mad</strong>: tức phát điên lên</li></ul><p>eg: She was hopping mad when she found out her daughter had disobeyed her. (Cô ấy tức phát điên lên khi cô ấy phát hiện ra con gái mình đã không vâng lời cô.)</p><ul><li><strong>in a black mood:</strong> trong tình trạng phẫn uất</li></ul><p>eg: Be careful what you say – she’s in a black mood today. (Hãy cẩn thận những gì bạn nói – cô ấy đang trong tình trạng phẫn uất.)</p><h2 style=\"font-style:italic;\"><span style=\"color:#B22222\"><strong>Những thành ngữ chỉ sự giận dữ.</strong></span></h2><ul><li><strong>cheesed off:</strong> giận dữ</li></ul><p>eg: I was really cheesed off when I lost the competition. (Tôi đã rất giận khi tôi thua cuộc.)</p><ul><li><strong>to not be on speaking terms</strong>: bất hòa đến mức không nói chuyện với nhau.</li></ul><p>eg: They‘re not on speaking terms at the moment after their row. (Lúc này họ đang bất hòa đến mức không nói chuyện với nhau sau cuộc đi chơi bằng thuyền.)</p><ul><li><strong>To be off someone’s Christmas card list:</strong> không nói chuyện với nhau nữa (giữa hai người)</li></ul><p>eg: Oh dear. I think I‘m off her Christmas card list after insulting her husband! (Trời ơi. Tôi nghĩ là tôi với cô ấy sẽ không nói chuyện với nhau nữa sau khi xúc phạm chồng cô ấy!)</p><ul><li><strong>have a downer on someone:</strong> tức giận ai</li></ul><p>eg: What’s John done? You seem to have a real downer on him. (John đã làm gì vâjy? Anh có vẻ rất tức giận anh ta.)</p><ul><li><strong>rub someone up the wrong way</strong>: chọc tức ai</li></ul><p>eg: Those two are always arguing. They just seem to rub each other up the wrong way. (Hai người luôn luôn cãi nhau. Họ có vẻ vừa chọc tức nhau thì phải.)</p></div>",
    "page": 3
  },
  {
    "id": 41,
    "title": "Các mẫu câu nói \"XIN LỖI\"",
    "a_href": "https://tienganhtflat.com/blog/cac-mu-cau-noi-xin-li",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/i-am-sorry-wallpaper-7003fbea0f-a1a071f128e911c061b1e5a1f7682b35.jpg",
    "viewer": "2,821",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p> - Sorry.<br/>\n <br/>\n- I'm sorry.<br/>\n <br/>\n- I'm so sorry!<br/>\n <br/>\n- Terribly sorry!<br/>\n <br/>\n- Sorry for your loss. (=&gt; Khi chia buồn vì sự mất mát của người kia)<br/>\n <br/>\n- Sorry to hear that. (=&gt; Khi nghe ai chia sẻ một tin không vui)<br/>\n <br/>\n- I apologize. (=&gt; Khi bạn mắc lỗi)<br/>\n <br/>\n- Sorry for keeping you waiting. (=&gt; Xin lỗi vì để bạn đợi lâu)<br/>\n <br/>\n- Sorry I'm late. (=&gt; Xin lỗi tôi tới muộn)<br/>\n <br/>\n- Please forgive me. (=&gt; Làm ơn tha thứ cho tôi)<br/>\n <br/>\n- Sorry, I didn't mean to do that. (=&gt; Xin lỗi, tối không cố ý làm vậy)<br/>\n <br/>\n- I owe you an apology. (khi bạn vừa gây lỗi)<br/>\n <br/>\n- I don’t mean to make you displeased. (=&gt; Tôi không cố ý làm anh phật lòng)<br/>\n <br/>\n- How should I apologize you? (=&gt; Tôi phải xin lỗi anh như thế nào đây)<br/>\n <br/><span style=\"color:#800000\"> <strong>Xin lỗi trước khi bạn muốn nhờ người khác làm gì</strong></span><br/>\n <br/>\n- Excuse me<br/>\n <br/>\n- Pardon me<br/>\n <br/><span style=\"color:#800000\"><strong> Cách xin lỗi với bạn bè một cách thoải mái, suồng sã (slang)</strong></span><br/>\n <br/>\n- My bad! (phổ biến với lứa tuổi thiếu niên)<br/>\n <br/>\n- Whoops! (cách nói thoải mái giữa bạn bè thân thiết)<br/>\n <br/>\n- Oops, sorry! (nói thoải mái giữa bạn bè thân thiết hoặc hàm ý mỉa mai)<br/>\n <br/>\n- Oops, I did it again. (nhắc lại lời bài hát cùng tên của ca sĩ Britney Spears)<br/>\n <br/><strong> <span style=\"color:#800000\">Xin lỗi trang trọng, xã giao trong văn nói và viết</span></strong><br/>\n <br/>\n- Pardon me! (Văn nói)<br/>\n <br/>\n- I have to say sorry. (Văn nói)<br/>\n <br/>\n- I beg your pardon. (Tôi nợ anh một lời xin lỗi)<br/>\n <br/>\n- I must apologize.<br/>\n <br/>\n- Please forgive me.<br/>\n <br/>\n- I hope that you can forgive me.<br/>\n <br/>\n- I'm awfully/ terribly sorry. (=&gt; Tôi thực sự xin lỗi)<br/>\n <br/>\n- I cannot express how sorry I am. (=&gt; Tôi không thể diễn tả được mình cảm thấy hối hận như thế nào)<br/>\n <br/>\n- It (something) was inexcusable. (=&gt; Điều đó đúng là không thể tha thứ được)<br/>\n <br/>\n- There is no excuse for my behavior. (=&gt; Tôi không có lời bào chữa nào cho hành vi của mình)<br/>\n <br/>\n- I feel that I should be responsible for that matter. (=&gt; Tôi cảm thấy phải chịu trách nhiệm về việc đó)<br/>\n <br/><strong><span style=\"color:#800000\"> Lời xin lỗi ở đầu bức thư, email trang trọng</span><br/>\n </strong><br/>\n- I would like to express my regret. (=&gt; Tôi muốn nhấn mạnh sự hối tiếc của mình)<br/>\n <br/>\n- I apologize wholeheartedly/ unreservedly. (=&gt; Tôi toàn tâm toàn ý muốn xin lỗi)<br/>\n <br/><strong> <span style=\"color:#800000\">Lời​ xin lỗi ở cuối bức thư, email trang trọng</span><br/>\n </strong><br/>\n- Sincerely apologies. (=&gt; Lời xin lỗi chân thành)<br/>\n <br/>\n- Please accept my/ our sincere apologies. (=&gt; Làm ơn chấp nhận lời xin lỗi chân thành của tôi/ chúng tôi)<br/>\n <br/>\n- Please accept my/ our humblest apologies. (=&gt; Làm ơn chấp nhận lời xin lỗi bé nhỏ của tôi/ chúng tôi)</p></div>",
    "page": 3
  },
  {
    "id": 42,
    "title": "Mẫu câu dùng để cổ vũ và động viên",
    "a_href": "https://tienganhtflat.com/blog/mu-cau-dung-c-v-va-ng-vien",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/cach-doi-pho-voi-tre-buong-binh--776ff7886e-ff48621e71ae4885ae4af8e9625a599e.jpg",
    "viewer": "21,891",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><h2 style=\"font-style:italic;\"><strong>NHỮNG CÂU CỔ VŨ</strong></h2><p><strong>Khi cấp trên khen và động viên cấp dưới.</strong></p><p>1.      You’re coming along well. (Bạn đang làm rất tốt.)<br/>\n <br/>\n2.      Keep up the good work. (Tiếp tục giữ vững phong độ tốt như vậy nhé)<br/>\n <br/>\n3.      That’s a good effort. (Đó là sự cố gắng tuyệt vời.)<br/>\n <br/>\n4.      That’s a real improvement. (Đó là một sự tiến bộ thực sự.)<br/>\n <br/>\n5.      You’re on the right lines. (Bạn đang đi đúng hướng rồi đó.)<br/>\n <br/>\n6.      Keep going. (Tiếp tục cố gắng nhé!)</p><p style=\"text-align: center;\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/%C4%91%E1%BB%99ng-vi%C3%AAn.png?1477454313982\"/></p><p><strong>Khi động viên một người đang tự ti về khả năng của mình.</strong></p><p>7.      Come on, you can do it! (Cố lên, bạn làm được mà.)</p><p><strong>Khi động viên một người đang cố gắng làm một điều mới mẻ.</strong></p><p>8.      Give it your best shot! (Hãy làm bằng hết sức bạn có thể)<br/>\n <br/>\nK<strong>huyên một người đang phân vân trong một việc gì đó.</strong></p><p>9.      What have you got to lose? (Bạn còn gì để mất chứ?)</p><p><strong>Động viên một người nào đó vừa gặp thất bại. </strong></p><p>10.  If at first you don’t succeed…try and try again. (Nếu lúc đầu bạn chưa thành công, hãy cố gắng và cố gắng lại thử xem.)<br/>\n </p><h2 style=\"font-style:italic;\"><strong>NHỮNG CÂU ĐỘNG VIÊN</strong></h2><p>1.      Cheer up! / Chin up! (Vui lên!)<br/>\n <br/>\n2.      Smile! (Cười lên!)<br/>\n <br/><strong>=&gt; Câu 1 và 2 dùng để cổ vũ một cách thân mật cho những người bạn thấy có vẻ đang không vui.</strong><br/>\n <br/>\n3.      It’s not the end of the world. (Chưa phải là kết thúc của thế giới mà.)<br/>\n <br/>\n4.      Worse things happen at sea. <br/>\n <br/><strong>=&gt; Câu 3 và 4 là những câu nói thông dụng để an ủi, cổ vũ một người đang cảm thấy rất tệ về một chuyện nào đó. Nhưng bạn phải cẩn thận, chỉ dùng khi chuyện đó không thực sự tệ như người đó nghĩ, còn nếu chuyện đó thực sự là một chuyện xấu thì dùng 2 câu này rất bất lịch sự.</strong></p><p style=\"text-align: center;\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/co-len-tieng-nhat-4.jpg?1477454373062\"/><br/>\n </p><p>5.      Look on the bright side! (Hãy nhìn vào mặt tích cực nào!)<br/>\n <br/>\n6.      Every cloud has a silver lining.<br/>\n <br/><strong>=&gt; Câu 5 và 6 động viên người khác hãy lạc quan và nhìn vào mặt tích cực của vấn đề.</strong><br/>\n <br/>\n7.      Practice makes perfect. (Học đi đôi với hành)<br/>\n <br/><strong>=&gt; Câu này cổ vũ một người đang cảm thấy khó khăn khi làm việc gì đó hoặc đang bực bội vì không thể làm một việc gì đó.</strong><br/>\n <br/>\n8.      There are plenty more fish in the sea. (Cuộc đời còn gặp nhiều người mà.)<br/>\n <br/><strong>=&gt; Câu này dùng để cổ vũ một người vừa chia tay hoặc thất bại trong chuyện tình cảm.</strong><br/>\n <br/>\n9.      Lighten up! (Tươi sáng lên!)<br/>\n <br/>\n10.  There’s no use crying over spilt milk. (Chuyện đã rồi, có khóc lóc cũng chẳng được gì!)<br/>\n <br/><strong>=&gt; Câu 9 và 10 ít mang tính đồng cảm hơn mà nghiêng về tính khuyên nhủ một người nào đó hãy vượt qua chuyện buồn bực.</strong></p></div>",
    "page": 3
  },
  {
    "id": 43,
    "title": "MẪU CÂU HỎI VÀ TRẢ LỜI VỀ THỜI TIẾT",
    "a_href": "https://tienganhtflat.com/blog/mu-cau-hi-va-tr-li-v-thi-tit",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/weather-1-341487bbbd-d6e2c172bcade6cbd0f72deea419ebb4.png",
    "viewer": "46,540",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><h2 style=\"font-style:italic\"><strong>A:  Hỏi về thời tiết trong ngày, chúng ta sử dụng mẫu câu: </strong></h2><ul><li><strong>What's the weather like today?</strong> (Thời tiết hôm nay như thế nào?)</li><li><strong>Do you know what the weather will be like tomorrow? </strong>(Bạn có biết thời tiết sẽ như thế nào vào ngày mai?)</li><li><strong>Do you know if it's going to rain tomorrow? </strong>(Bạn có biết trời có mưa vào ngày mai không?)</li><li><strong>Did you see the weather forecast?</strong> (Anh đã xem dự báo thời tiết chưa?)</li></ul><p><strong>Mẫu câu trả lời:</strong></p><p>          - It’s + adjective (hot, cold…)</p><p><u>Ví dụ:  </u></p><ul><li>It's sunny - Trời nắng</li><li>It's raining - Trời đang mưa</li><li>It's hot - Trời nóng</li><li>It's cold - Trời lạnh</li><li>It's cloudy -Trời nhiều mây</li><li>It's windy - Trời nhiều gió</li><li>It's foggy - Trời có sương mù</li><li>It's stormy - Trời có bão</li></ul><h2 style=\"font-style:italic; text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/weather.png?1477451457968\"/></h2><h2 style=\"font-style:italic\"><strong>B: Từ vựng diễn tả về thời tiết</strong></h2><p><strong>1. TRỜI QUANG HOẶC NHIỀU MÂY</strong></p><p>• Bright: (adjective) nhiều ánh sáng, khi mặt trời chiếu sáng mạnh<br/>\n• Sunny: (adjective) bầu trời chỉ có mặt trời chiếu sáng, không có mây.<br/>\n• Clear: (adjective) trời không mây<br/>\n• Fine: (adjective) không mưa, không mây<br/>\n• Partially cloudy: (adjective) khi có sự pha trộn của bầu trời xanh và mây<br/>\n• Cloudy: (adjective) có rất nhiều mây trên bầu trời<br/>\n• Overcast: (adjective) bầu trời bị bao phủ bởi mây, âm u<br/>\n• Gloomy: (adjective) với những đám mây đen và ánh sáng mờ nhạt<br/>\n• Fog (noun)/ foggy (adjective): lớp mây dày ở gần mặt đất, sương mù<br/>\n• Mist (noun) / misty (adjective): sương mù nhẹ, thường xuất hiện trên biển hoặc gây ra bởi mưa phùn<br/>\n• Haze (noun) / hazy (adjective): màn sương mỏng, thường gây ra bởi sức nóng.</p><p><strong>2. CÁC KIỂU MƯA</strong></p><p>• Damp: (adjective) ướt nhẹ (thường xuất hiện sau khi cơn mưa đã dừng)<br/>\n• Drizzle: (verb/noun) mưa nhẹ với những giọt rất mịn<br/>\n• Shower: (noun) mưa trong một thời gian ngắn<br/>\n• Rain: (verb/noun) nước rơi từ những đám mây theo từng giọt<br/>\n• Downpour: (noun) mưa lớn<br/>\n• Pour: (verb) có mưa lớn<br/>\n• It’s raining cats and dogs: thành ngữ chỉ mưa lớn<br/>\n• Torrential rain: (noun) mưa rất lớn<br/>\n• Flood: (verb/noun) bị bao phủ bởi nước do mưa quá mức.</p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/21_1453801726.jpg?1477452507961\"/></p><p><strong>3. CÁC KIỂU TUYẾT</strong></p><p>• Hail: (verb) khi mưa bị đóng băng và rơi thành từng viên đá nhỏ (hailstones).<br/>\n• Hailstones: (noun) những viên đá nhỏ rơi từ trên trời<br/>\n• Snow: (noun/verb) mưa bị đóng băng và rơi từ trên trời dưới dạng bông tuyết mềm<br/>\n• Snowflake: (noun) một phần riêng lẻ của tuyết rơi<br/>\n• Sleet: (noun/verb) tuyết rơi hay mưa đá lẫn cùng mưa (thường là có gió)<br/>\n• Blizard: (noun) cơn bão tuyết nghiêm trọng với sức gió mạnh.</p><p><strong>4. CÁC KIỂU GIÓ</strong></p><p>• Breeze: một cơn gió thoảng (thường nhẹ hay sảng khoái)<br/>\n• Blustery: cơn gió mạnh thổi qua<br/>\n• Windy: gió thổi liên tục.<br/>\n• Gale: một cơn gió rất mạnh<br/>\n• Hurricane/cyclone/typhoon: Dạng của bão và mưa lớn kèm lốc xoáy.</p><h2 style=\"font-style:italic\">C. Một số mẫu câu thông dụng về THỜI TIẾT</h2><ul><li>What a nice day!  <em>               Hôm nay trời đẹp thật:</em></li><li>What a beatyful day!            <em>Hôm nay trời đẹp thật:</em></li><li>it’s not a very nice day         H<em>ôm nay trời không đẹp lắm</em></li><li>what a terrible day!              H<em>ôm nay trời chán quá!</em></li><li>what miserable weather!     <em> Thời tiết hôm nay tệ quá!</em></li><li>It’s starting to rain                 <em>Trời bắt đầu mưa</em></li><li>It’s stopped raining               <em>Trời tạnh mưa rồi</em></li><li>It’s pouring with rain              <em>Trời đang mưa to lắm</em></li><li>It’s raining cats and dogs     <em> Trời đang mưa như trút nước</em></li></ul><p style=\"text-align: center;\"><em>​<img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/14095783_1813839675518356_6943838738034613781_n.png?1477453056785\"/></em></p><ul><li>The weather’s fine                 <em>Trời đẹp</em></li><li>The sun’s shinning                <em>Trời đang nắng</em></li><li>There’s not a cloud in the sky          <em>Trời không một bóng mây</em></li><li>The sky’s overcast                           <em>Trời âm u</em></li><li>I’s clearing up                           <em>Trời đang sáng dần</em></li><li>The sun’s come out                <em> Mặt trời đang ló ra</em></li><li>The sun’s just gone in             <em> Mặt trời vừa bị che khuất</em></li><li>There’s a strong wind              <em>Trời đang có gió mạnh</em></li><li>The wind’s dropped                  <em>Gió đã bớt mạnh</em></li><li>The sound like thunder             <em>Nghe như có sấm</em></li><li>That’s lightning                              <em>Có chớp</em></li><li>We had a lot of heavy rain in this morning      <em>Sáng nay trời mưa to rất lâu</em></li><li>We haven’t had any rain for a fortnight            <em>Cả nửa tháng nay trời không mưa</em></li></ul></div>",
    "page": 3
  },
  {
    "id": 44,
    "title": "Phân biệt \"At the end\" và \"In the end\"",
    "a_href": "https://tienganhtflat.com/blog/phan-bit-at-the-end-va-in-the-end",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/at-in-the-end-ce48fa156d-d6e2c172bcade6cbd0f72deea419ebb4.jpg",
    "viewer": "41,659",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20c%C4%83n%20b%E1%BA%A3n/at-in%20the%20end.jpg?1477382788519\"/></p><p><big><strong>1. At the end: Thời điểm mà việc gì đó kết thúc.</strong></big></p><p>Ex1: We are going away at the end January. </p><p>Ex2: At the end of the concert, there was great applause.</p><p>Ex3: The player shook hands at the end of the game.</p><p><u>Nhận xét:</u></p><p>=&gt; Cả 3 ví dụ này các bạn đều nhận thấy có một điểm chung là chỉ THỜI ĐIỂM KẾT THÚC thì một hành động nào đó xảy ra.</p><p>- Ở ví dụ đầu tiên thì thời điểm xảy ra là cuối tháng 1 và khi đó chúng tôi mới đi xa.</p><p>- Ở ví dụ thứ hai thì vào cuối buổi hòa nhạc, hành động vỗ tay xảy ra.</p><p>- Ở ví dụ thứ ba thì cuối trận đấu việc bắt tay mới xảy ra.</p><p>Như vậy, qua 3 ví dụ này chúng ta nhận ra rằng AT THE END được dùng để chỉ một hành động xảy ra vào lúc việc gì đó kết thúc. Nhất mạnh về thời gian xảy ra.</p><p><big><strong>2. In the end: Kết quả cuối cùng của tình huống, cuối cùng.</strong></big></p><p>Ex1: We had a lot of problems with our car. We sold it in the end.</p><p>Ex2: He got more and more angry. In the end he just walked out of the room.</p><p>Ex3: Nancy couldn't decide where to go for his holidays. He didn't go anywhere in the end.</p><p><u>Nhận xét:</u></p><p>=&gt; Như vậy từ 3 ví dụ này, chúng ta đều thấy nói đến KẾT QUẢ CUỐI CÙNG CỦA TÌNH HUỐNG.</p><p>- Ở ví dụ đầu nói đến việc chúng tôi gặp vấn đề với xe hơi, nhưng cuối cùng chúng tôi đã sửa được.</p><p>- Ở ví dụ thứ hai nói việc anh ấy càng lúc càng tức giận và kết quả là anh ta đi ra khỏi phòng.</p><p>- Ở ví dụ cuối thì Nancy đắn đo việc đi đâu cho kỳ nghỉ và kết quả là cô ấy không đi nữa.</p><p>Ta nhận thấy ở 3 ví dụ này là đều nói đến kết quả của hành động, một tình huống.</p><p><u><strong>Tóm lại</strong></u>: AT THE END để nhấn mạnh THỜI ĐIỂM cuối cái gì đó, còn IN THE END thì nhấn mạnh KẾT QUẢ cuối cùng của tình huống.</p></div>",
    "page": 3
  },
  {
    "id": 45,
    "title": "Những lời chúc ngủ ngon ngọt ngào",
    "a_href": "https://tienganhtflat.com/blog/nhng-li-chuc-ng-ngon-ngt-ngao",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/good-night-c50faea69d-7b370017d05fc0efb28e67c0e587340b.png",
    "viewer": "9,707",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p><strong>1. Good night, my little prince/princess.</strong></p><p>Chúc anh/em ngủ ngon nhé, hoàng tử/công chúa nhỏ của anh/em.</p><p><strong>2. Good night, sweet heart!</strong></p><p>Chúc cục cưng của anh ngủ ngon nhé!</p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20c%C4%83n%20b%E1%BA%A3n/good%20night.jpg?1477379788497\"/></p><p><strong>3. Good night and sweet dreams!</strong></p><p>Chúc anh ngủ ngon và có những giấc mơ đẹp!</p><p><strong>4. Have a nice/sound sleep.</strong></p><p>Chúc em có một giấc ngủ ngon.</p><p><strong>5. Good night, nice and peaceful dreams</strong></p><p>Chúc em ngủ ngon, có giấc mơ đẹp và bình yên nhé.</p><p><strong>6. Every day I love you more than yesterday. Have a wonderful night.</strong></p><p>Mỗi ngày anh lại yêu em nhiều hơn ngày hôm qua. Chúc em có giấc ngủ thật tuyệt vời.</p><p><strong>7. Good night! I love you so much.</strong></p><p>Chúc em ngủ ngon. Anh yêu em nhiều lắm.</p><p><strong>8. I used to think that dreams do not come true, but this quickly changed at the moment I laid my eyes on you. Good night.</strong></p><p>Anh từng nghĩ giấc mơ sẽ không trẻ trở thành hiện thực, nhưng ý nghĩ ấy đã thay đổi  kể từ giây phút anh nhìn thấy em. Ngủ ngon nhé em.</p><p><strong>9. I wish I might be there guarding your sleeping tonight, good night and sweet dreams.</strong></p><p>Anh ước gì anh có thể ở đó để canh giấc ngủ cho em đêm nay. Chúc em ngủ ngon và có giấc mơ ngọt ngào.</p><p style=\"text-align:center\"><strong><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20c%C4%83n%20b%E1%BA%A3n/10.jpg?1477379868865\"/>1</strong></p><p><strong>10. I was looking out the window and thinking about the person I love so much. That is you. So I just wanna wish you a good night.</strong></p><p>Anh đang nhìn ra ngoài cửa sổ và nghĩ về người mà anh yêu rất nhiều. Người ấy chính là em bởi vậy anh muốn chúc em ngủ ngon.</p><p><strong>11. I wish you always be good and have comfortable mood to have a good night.</strong></p><p>Anh mong sao em luôn khoẻ mạnh và tâm trạng thoải mái để có một giấc ngủ ngon.</p><p><strong>12. No matter where you are… you are always in my thought! Good night.</strong></p><p>Cho dù em có ở đâu đi chăng nữa thì em vẫn luôn trong tâm trí anh. Chúc em ngủ ngon.</p><p><strong>13. Good night my love. Wish you have pleasant dreams. Please sleep tight my love, tomorrow will be beautifully sunny and bring you closer to me</strong>.</p><p>Ngủ ngon nhé tình yêu của anh. Mong em có những giấc mơ thú vị. Người yêu hãy ngủ ngon, có thể ngày mai trời sẽ nắng đẹp và đưa em đến gần bên anh hơn.</p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20c%C4%83n%20b%E1%BA%A3n/Romantic-good-night-quote-for-girlfriend.jpg?1477380014860\"/></p><p><strong>14. A day is going gone. It is nice to have someone like you making my everyday seems to become more beautiful. Thank you my love and hope all the angels will guard you this night.</strong></p><p>Một ngày rồi cũng sẽ qua đi. Thật hạnh phúc khi có người như em để làm mỗi ngày của anh trở nên đẹp hơn. Cám ơn tình yêu của anh và mong những thiên thần sẽ canh giấc ngủ cho em đêm nay.</p><p><strong>15. I’ll try to sleep so that I can keep you in my dreams. Please go to bed before my sleeping. Miss you so much.</strong></p><p>Anh sẽ cố gắng ngủ để có thể giữ em trong giấc mơ của anh. Em hãy đi ngủ trước anh đi. Nhớ em rất nhiều.</p><p><strong>16. I love all the stars in the sky, but they are nothing compared to the ones in your eyes! So I’ll think about you as I turn in for the night. Good night</strong></p><p>Anh yêu những vì sao trên bầu trời, nhưng chúng không thể sánh bằng người đang ở trong đôi mắt anh. Bởi vì anh đang nghĩ về em khi anh ở trong màn đêm. Chúc em ngủ ngon nhé.</p><p><strong>17. Every night I love coming back home because of being in your arms. Good night my love.</strong></p><p>Hàng đêm em mong muốn được trở về nhà vì sẽ được anh ôm trong vòng tay. Ngủ ngon nhé anh yêu.</p><p><strong>18. Lying on my bed, looking at the clock, I know that it is time to go bed. I wonder how you have been today… Hope that everything is alright. Wish you sweet and restful dreams.</strong></p><p>Nằm trên giường và nhìn đồng hồ, anh biết rằng đã đến giờ đi ngủ. Nhưng anh vẫn phân vân không biết hôm nay em thế nào?? Mong rằng mọi chuyện đều ổn. Chúc em có những giấc mơ ngọt ngào và ngon giấc.</p><p>Đừng quên gửi những lời ngọt ngào đến người yêu thương của mình mỗi ngày và nhớ đính kèm những ký tự đặc biệt để tăng thêm phần lãng mạn nhé!</p><p> </p></div>",
    "page": 3
  },
  {
    "id": 46,
    "title": "Một số Idioms thông dụng trong tiếng anh",
    "a_href": "https://tienganhtflat.com/blog/mt-s-idioms-thong-dng-trong-ting-anh",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/untitled-1-864eb064eb-bf2fb4f20f164387a91730e0d8dab361.png",
    "viewer": "4,337",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p><strong>1. A little bird told me</strong> : Someone secretly told me (Có người nói riêng cho tôi biết)</p><p>Ex: A little bird told me that you and Cindy are going to get married<br/>\n(Có người nói riêng cho tôi biết rằng anh và Cindy sắp lấy nhau)</p><p><strong>2. A pain in the neck</strong> : Annoying (Cái của nợ, làm phiền)</p><p>Ex: Sometimes my younger brother can be a pain in the neck.<br/>\n(Đôi khi em trai tôi có thể là cái của nợ)</p><p><strong>3. A piece of cake:</strong> Very easy (rất dễ)</p><p>Ex: Learning to speak English is a piêc of cake<br/>\n(Học nói tiếng anh rất dễ)</p><p><strong>4. To lay off:</strong> When an employer forces employees to leave their jobs (Sa thải)</p><p>Ex: The company laid off 50 workers last week. Now they have no job<br/>\n(Tuần trước công ty đó đã sa thải 50 công nhân. Hiện giờ họ không có việc làm)</p><p><strong>5. And pigs might fly</strong>: To think something is impossible or unbelievable (Chuyện/điều khó tin)</p><p>Ex: I think I can win the lottery<br/>\n(Tôi nghĩ là tôi có thể trúng vé số)</p><p><strong>6. To be dead tired:</strong> To be exhausted (Mệt nhừ)</p><p>Ex: I've worked for 15 hours already today and I'm dead tired<br/>\n(Hôm nay tôi đã làm việc 15 tiếng rồi và tôi mệt nhừ)</p><p><strong>7. To call it a day: </strong>Stop working (ngừng làm việc)</p><p>Ex: It's already 5:00 pm. Let's call it a day and go home<br/>\n(5 giờ chiều rồi. Chúng ta hãy ngừng làm việc và về nhà thôi)</p><p><strong>8. To be in charge of: </strong>to be the leader of (Phụ trách, điều hành, chỉ huy)</p><p>Ex: Do what Linda tells you to do because she's in charge of this office<br/>\n(Hãy làm việc mà Linda bảo bạn làm bởi vì cô ấy điều hành văn phòng này)</p></div>",
    "page": 3
  },
  {
    "id": 47,
    "title": "Phrasal Verbs with \"GET\"",
    "a_href": "https://tienganhtflat.com/blog/phrasal-verbs-with-get",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/sddefault-c0a0be551e-120410d3fdd712f335f1e44b992e99f0.jpg",
    "viewer": "20,495",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p style=\"text-align: center;\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/get.png?1477364180388\"/></p><p>• <strong>Get about</strong> : lan truyền</p><p>• <strong>Get ahead </strong>: tiến bộ<br/><br/>\n• <strong>Get at sth</strong> :tìm ra, khám phá ra<br/><br/>\n•<strong> Get at sb</strong> : chỉ trích, công kích<br/><br/>\n• <strong>Get away from</strong> :trốn thoát<br/><br/>\n• <strong>Get away with</strong> :thoát khỏi ( sự trừng phạt)<br/><br/>\n• <strong>Get back</strong> :trở về<br/><br/>\n• <strong>Get sth back </strong>:lấy lại<br/><br/>\n• <strong>Get behind</strong> :chậm trễ<br/><br/>\n• <strong>Get down </strong>:làm nãn lòng<br/><br/>\n• <strong>Get down to sth</strong> :bắt tay vào việc gì<br/><br/>\n• <strong>Get in/into sth</strong> :được nhận vào</p><p>• <strong>Get off </strong>:rời khỏi, xuống (xe, mát bay)<br/><br/>\n• <strong>Get on</strong> :lên ( tàu xe..)<br/><br/>\n• <strong>Get on with</strong> :hòa thuận<br/><br/>\n• <strong>Get out</strong> :lộ ra ngoài ( tin tức… )<br/><br/>\n• <strong>Get out of</strong> :lẩn tránh<br/><br/>\n• <strong>Get over</strong>: phục hồi, vượt qua<br/><br/>\n• <strong>Get through</strong> : vượt qua<br/><br/>\n• <strong>Get through to sb</strong> : làm ai hiểu được điều gì<br/><br/>\n• <strong>Get together</strong> :tụ họp<br/><br/>\n• <strong>Get up to</strong> :gây ra</p></div>",
    "page": 3
  },
  {
    "id": 48,
    "title": "11 cụm từ thú vị với \"CAN'T\"",
    "a_href": "https://tienganhtflat.com/blog/11-cm-t-thu-v-vi-cant",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/cant-3b232a347a-eca53013960066ec6330af25f8ba979a.png",
    "viewer": "1,757",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/13754153_1797782380457419_5864160811274711698_n.png?1477302486217\"/></p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/13700200_1797782383790752_1946481484217715380_n.png?1477302509249\"/></p></div>",
    "page": 3
  },
  {
    "id": 49,
    "title": "17 tin nhắn chào buổi sáng làm tan chảy trái tim của mọi phụ nữ",
    "a_href": "https://tienganhtflat.com/blog/17-tin-nhn-chao-bui-sang-lam-tan-chy-trai-tim-ca-mi-ph-n",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/text-message-a2eab0ff6f-18770f97f844182c823fa20314bc59b1.jpg",
    "viewer": "16,859",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p><strong>1- Good Morning, Beautiful!</strong></p><p><em>Chào buổi sáng, người đẹp!</em></p><p><strong>2- Thanks sunrise gives me a new day to love you!Good morning, my sweetheart. Hope you have an amazing day!</strong></p><p><em>Cảm ơn mỗi sớm mai tỉnh dậy cho anh một ngày mới để yêu em. Chào buổi sáng, trái tim ngọt ngào của anh/ người yêu dấu. Mong em có một ngày tuyệt vời</em></p><p><strong>3- I just woke up and you’re already on my mind.</strong></p><p><em>Anh vừa mới tỉnh dậy, và điều đầu tiên xuất hiện trong tâm trí là em.</em></p><p><strong>4- I love you in the morning, in the middle of the day, in the hours we are together, and the hours we are apart.</strong></p><p><em>Anh yêu em vào mỗi buổi sáng, buổi trưa, từng giờ khi chúng ta ở cạnh nhau và từng giờ chúng ta xa cách.</em></p><p><strong>5- Good morning baby. Have an amazing day. I love you.</strong></p><p><em>Chào buổi sáng cưng. Chúc em một ngày thú vị. Anh yêu em</em></p><p><strong>6- Good morning… I just wanted you to know how much I truly do care. You’re always in my thoughts.</strong></p><p><em>Chào buổi sáng… Anh chỉ muốn em biết được rằng anh thực sự quan tâm em nhiều thế nào. Luôn luôn nghĩ về em.</em></p><p><strong>7- Being in love with you makes every morning worth getting up for… Good Morning, Sweetheart!</strong></p><p><em>Yêu em là lý do để thức dậy mỗi sáng sớm. Chào buổi sáng, người yêu dấu!</em></p><p><strong>8- Every minute spent with you is a moment well spent. Good Morning.</strong></p><p><em>Ở bên em, thời gian đáng giá đến từng giây. Chào buổi sáng</em></p><p style=\"text-align:center\"><em><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/Good%20Morning%20Texts.jpg?1477296304564\"/></em></p><p><strong>9- Just wanted to say good morning to one of the person that means the world to me.</strong></p><p><em>Chỉ muốn gửi lời chào buổi sáng tới một người nào đó đã là cả thế giới của anh</em></p><p><strong>10- Hello my beautiful, Good Morning and as always I’m thinking of you.</strong></p><p><em>Xin chào người đẹp của anh, chúc em một buổi sáng tốt lành và như thường lệ, anh đang rất nhớ em.</em></p><p><strong>11- I must be the luckiest guy alive because every day I see the same girl who I saw in my dreams the previous night. Good morning.</strong></p><p><em>Anh chắc anh phải là người đàn ông may mắn nhất còn tồn tại vì mỗi ngày anh đều được nhìn thấy người con gái ở trong giấc mơ đêm trước. Chào buổi sáng.</em></p><p><strong>12- Good morning my love. You are like a blessing from the heavens above.</strong></p><p><em>Chào buổi sáng tình yêu của anh. Em giống như điều hạnh phúc từ trên thiên đàng ban xuống.</em></p><p><strong>13- Good Morning, my Love!</strong></p><p><em>Chào buổi sáng, tình yêu của anh!</em></p><p><strong>14- From morning’s first light to evening’s last star, always remember how special you are!</strong></p><p><em>Từ một ánh bình minh buổi sớm đầu tiên tới ngôi sao cuối cùng trong đêm luôn luôn nhớ em là người đặc biệt như thế nào với anh.</em></p><p><strong>15- Good Morning! I really do love you!</strong></p><p><em>Chào buổi sáng! Anh thật sự yêu em!</em></p><p><strong>16- I hope your morning is as bright as your smile.</strong></p><p><em>Anh ước buổi sáng của em sẽ rạng ngời như chính nụ cười của em vậy.</em></p><p><strong>17- A morning text does not simply mean, “Good morning.” Rather, it comes with the silent loving message, “I think of you when I wake up.”</strong></p><p><em>Không chỉ là một tin nhắn đơn thuần “chào buổi sáng” mà hơn thế nữa nó còn là lời thì thầm của anh “Mỗi khi anh tỉnh dậy điều đầu tiên anh làm là nghĩ về em”.</em></p></div>",
    "page": 3
  },
  {
    "id": 50,
    "title": "Những mẫu câu tiếng anh dùng trong làm việc nhóm",
    "a_href": "https://tienganhtflat.com/blog/nhng-mu-cau-ting-anh-dung-trong-lam-vic-nhom",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/8402643l-8d5870a15a-261a0117fa82eca3ebfecf7177844f9d.jpg",
    "viewer": "14,142",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p><strong>Đầu tiên, các mẫu câu sau được sử dụng để giới thiệu mở đầu các buổi thảo luận nhóm để nêu tầm quan trọng và hướng mọi người có trách nhiệm với công việc chung</strong></p><p>1. Team spirit is the most important factor to win victory.<br/><em>(Tinh thần đồng đội là yếu tố quan trọng nhất để chiến thắng.)</em></p><p>2. The team helps individuals develop within the team.<br/><em>(Cả đội sẽ giúp cho mọi cá nhân cùng phát triển.)</em></p><p>3. Team members should co-operative fully with each other.<br/><em>(Các thành viên của đội nên hoàn toàn hợp tác với nhau.)</em></p><p>4. If we brainstorm about a problem, we can get many different new ideas and find a solution.<br/><em>(Nếu cùng động não về một vấn đề, chúng ta sẽ có được nhiều ý tưởng khác nhau và tìm được cách giải quyết.)</em></p><p><strong>Các mẫu câu sau được dùng để điều khiển diễn biến của buổi làm việc nhóm:</strong></p><p>1. I’d like to introduce you to the new members of the project group.<br/><em>(Tôi muốn giới thiệu anh với những thành viên mới trong nhóm đề án.)</em></p><p>2. We’re glad you join us.<br/><em>(Chúng tôi rất vui khi có anh cùng tham gia.)</em></p><p>3. Can we talk a little bit about the project?<br/><em>(Chúng ta có thể nói chuyện một chút về dự án này không?)</em></p><p>4. Can you talk about what plans we have for the future?<br/><em>(Anh có thể nói đôi điều về những kế hoạch sắp tới của chúng ta không?)</em></p><p>5. We have about 20 minutes for questions and discussion.<br/><em>(Chúng ta có 20 phút cho các câu hỏi và thảo luận.)</em></p><p><strong>Các mẫu câu sau sử dụng để nêu vấn đề, đưa ra ý kiến về vấn đề thảo luận:</strong></p><p>1. That concludes the formal part of my presentation.<br/><em>Phần chính trong phần trình bày của tôi đến đây là kết thúc.</em></p><p>2. Thank you for listening.<br/><em>Cảm ơn mọi người đã lắng nghe.</em></p><p>3. I’d be very interested to hear your comments.<br/><em>Tôi rất hứng thú được nghe ý kiến của các anh.</em></p><p>4. Thank you for setting us straight on, true second level of our project.<br/><em>Cảm ơn vì đã sửa lại các sai lầm trong giai đoạn 2 ở đề án của chúng tôi.</em></p><p>5. That sounds great.<br/><em>Nghe có vẻ tuyệt đấy.</em></p><p>6. I have a question I would like to ask.<br/><em>Tôi có một câu hỏi muốn đặt ra.</em></p><p>7. Good question!<br/><em>Câu hỏi hay!</em></p><p>8. Now I’d like to open it up for questions.<br/><em>Bây giờ tôi sẽ trả lời các câu hỏi.</em></p><p style=\"text-align: center;\"><em><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20%C4%91i%20l%C3%A0m/TEAM%20WORK%201.png?1477290654981\"/></em></p><p style=\"text-align: center;\"><em><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20%C4%91i%20l%C3%A0m/TEAM%20WORK%202.png?1477290669858\"/></em></p></div>",
    "page": 3
  },
  {
    "id": 51,
    "title": "Những mẫu câu thông dụng khi đi mua sắm",
    "a_href": "https://tienganhtflat.com/blog/nhng-mu-cau-thong-dng-khi-i-mua-sm",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/tieng-anh-giao-tiep-co-ban-di-mu-ea5f690e07-c3ef6124e6c388ffb0a969b6955596a7.jpg",
    "viewer": "1,890",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/go%20shopping1.png?1477037320734\"/></p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/go%20shopping2.png?1477037335086\"/></p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/go%20shopping3.png?1477037342391\"/></p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/go%20shopping4.png?1477037351651\"/></p></div>",
    "page": 3
  },
  {
    "id": 52,
    "title": "Mẫu câu cơ bản cho người đi du lịch",
    "a_href": "https://tienganhtflat.com/blog/mu-cau-c-bn-cho-ngi-i-du-lch",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/bi-quyet-du-lich-tet-nguyen-dan--be23a5aa43-688df2cb4ef0eac72f93add37ef1ff12.jpg",
    "viewer": "2,035",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/DU%20L%E1%BB%8ACH%201.png?1477036585791\"/></p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/DU%20L%E1%BB%8ACH%202.png?1477036602736\"/></p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/Du%20l%E1%BB%8Bch%203.png?1477036648425\"/></p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/Du%20l%E1%BB%8Bch%204.png?1477036658826\"/></p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/Du%20l%E1%BB%8Bch%205.png?1477036689376\"/></p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/Du%20l%E1%BB%8Bch%206.png?1477036697371\"/></p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/Du%20l%E1%BB%8Bch%207.png?1477036704711\"/></p><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/Du%20l%E1%BB%8Bch%208.png?1477036711367\"/></p><p style=\"text-align:center\"> </p></div>",
    "page": 3
  },
  {
    "id": 53,
    "title": "Phrasal verbs with \"TAKE\"",
    "a_href": "https://tienganhtflat.com/blog/phrasal-verbs-with-take",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/maxresdefault-a1e3a73b05-18770f97f844182c823fa20314bc59b1.jpg",
    "viewer": "36,961",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p style=\"text-align:center\"><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20trung%20c%E1%BA%A5p/nevD4UMZ2Y4.jpg?1477031977551\"/></p><p><strong>- take after sb</strong> : trông giống hay có hành động giống ai đó lớn hơn trong gia đình mình</p><p><strong>- take sth away </strong>: làm mất ( cảm giác )</p><p><strong>- take sth/sb away ( from sb ) </strong>: lấy cái gì / lấy ai khỏi người nào đó</p><p><strong>- take sth apart</strong> : tháo cái gì rời ra</p><p><strong>- take sth back</strong> : trả lại cái gì vào chổ cũ , thừa nhân mình sai</p><p><strong>- take sb aback</strong> : làm cho ai đó bị sốc</p><p><strong>- take sb in</strong> : lường gạt ai</p><p><strong>- take sth in </strong>: hiểu cái gì bạn thấy , nghe hay đọc</p><p><strong>- take sth down</strong> : ghi chú điều mới nói , triệt hạ một kiến trúc nào đó ( building , bridge ….)</p><p><strong>- take sb on</strong> : bắt đầu thuê mướn ai</p><p><strong>- take sth on</strong> : chấp nhận hay quyết định làm việc gì</p><p><strong>- take off </strong>: cất cánh ( dùng cho máy bay…)/ trở nên thành công và nổi tiếng</p><p><strong>- take sb off</strong> : nhái theo cách cư xử hay điệu bộ ai đó</p><p><strong>- take sth off</strong> : cởi , lột … ; hay nghĩa nghỉ lễ</p><p><strong>- take sth out ( of sth )</strong> : lấy cái gì ra</p><p><strong>- take sth out</strong> : lấy bộ phận cơ thể ra ( nhổ răng , mổ ruột thừa …. )</p><p><strong>- take sb out </strong>: đi ra ngoài với ai</p><p><strong>- take it from ( me ) </strong>: tin ( tôi ) đi</p><p><strong>- take it out on sb</strong> : giận dữ với ai theo kiểu giận cá chém thớt</p><p><strong>- take sth over</strong> : kiểm soát hay chịu trách nhiệm về cái gì</p><p><strong>- take to th/sb</strong> : thấy thích thú ai/ cái gì</p><p><strong>- take to doing sth</strong> : bắt đầu làm cái gì một cách thường xuyên</p><p><strong>- take sth up with sb</strong> : khiếu nại việc gì</p><p><strong>- take up sth</strong> : chiếm 1 khoảng thời gian hay không gian</p><p><strong>- be taken with sb/ sth</strong> : nhận thấy ai / cái gì hấp dẫn và thú vị</p><p><strong>- take sb up on sth</strong> : đề xuất mà ai đó đưa ra không dồng ý với ai về diều người đó vừa nói và yêu cầu người đó giải thích / mang nghĩa chấp nhận lời</p></div>",
    "page": 3
  },
  {
    "id": 54,
    "title": "CÁCH HẸN GẶP MỘT AI ĐÓ",
    "a_href": "https://tienganhtflat.com/blog/cach-hn-gp-mt-ai-o",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/calls-d30d5c1340-a1a071f128e911c061b1e5a1f7682b35.png",
    "viewer": "2,294",
    "category": "blog-tieng-anh-trung-cap",
    "detail_content": "<div class=\"content\"><hr/><p><span style=\"color:#800000\"><big><strong>1. Cách hẹn gặp ai đó</strong></big></span></p><p>- Are you free tomorrow? ------&gt; <em>(Ngày mai bạn có rảnh không?)</em></p><p>- Can we meet on the 26th? ------&gt; <em>(Chúng ta có thể gặp nhau vào ngày 26 chứ?)</em></p><p>- Are you available tomorrow? ------&gt; <em>(Ngày mai bạn có rảnh không?)</em></p><p>- Are you available next Monday? ------&gt; <em>(Thứ 2 tới bạn rảnh chứ?)</em></p><p>- Are you free this evening? ------&gt; <em>(Tối nay bạn rảnh chứ?)</em></p><p>- What about the 15th of this month? Would it suit you? ------&gt; <em>(Thế còn ngày 15 tháng này thì sao? Bạn rảnh chứ?)</em></p><p>- Is next Monday convenient for you? ------&gt;<em> (Thứ 2 tới có tiện cho bạn không?)</em></p><p>- Can we meet sometime next week? ------&gt; <em>(Chúng ta có thể gặp nhau hôm nào đó vào tuần tới chứ?)</em></p><p style=\"text-align:center\"><em><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20c%C4%83n%20b%E1%BA%A3n/telephone_call.png?1476957129166\"/></em></p><p><span style=\"color:#800000\"><big><strong>2. Đồng ý hẹn (Agreeing on a date)</strong></big></span></p><p>- Yes, I’m free tomorrow. ------&gt; <em>(Vâng, mai tôi rảnh)</em></p><p>- Yes, we can meet on the 26th. ------&gt;<em> (Vâng, 26 chúng ta có thể gặp nhau)</em></p><p>- Yes, next Monday is fine. ------&gt; <em>(Vâng, thứ 2 tới được đó)</em></p><p>- No problem, we can meet tomorrow. ------&gt; <em>(Được thôi, mai chúng ta sẽ gặp nhau)</em></p><p style=\"text-align:center\"><em><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/ti%E1%BA%BFng%20anh%20c%C4%83n%20b%E1%BA%A3n/phone-call-clipart-1.gif?1476957147413\"/></em></p><p><span style=\"color:#800000\"><big><strong>3. Gợi ý một ngày hẹn khác (Suggesting a different date</strong></big></span></p><p>- I’m afraid I can’t make it on the 16th. Can we meet on the 17th or 18th? ------&gt; <em>(Tôi e rằng ngày 16 tôi không thể tới được. Chúng ta có thể gặp nhau ngày 17 hoặc 18 được không?)</em></p><p>- Monday isn’t quite convenient for me. Could we meet on Tuesday instead? ------&gt; (<em>Thứ 2 hơi bất tiện cho tôi. Ta gặp nhau vào thứ 3 được chứ?</em></p><p>- 15th is going to be a little difficult. Can’t we meet on the 16th? ------&gt; <em>( Ngày 15 thì hơi khó. Chúng ta hẹn vào ngày 16 nhé?)</em></p><p><span style=\"color:#800000\"><big><strong>4. Thay đổi lịch hẹn đã sắp xếp trước đó (Changing the arrangement)</strong></big></span></p><p>- You know we had agreed to meet on the 15th? Well, I’m really sorry. I can’t make it after all. Some urgent business has come up. Can we fix another date?<br/><em>(Chúng ta có cuộc hẹn vào ngày 15 đúng không? Tôi rất xin lỗi, tôi không thể tới vào ngày hôm đó được vì vướng một việc gấp. Chúng ta có thể hẹn gặp vào ngày khác được không?)</em></p><p>- Some urgent business has suddenly cropped up and I won’t be able to meet you tomorrow. Can we fix another time?<br/><em>(Có một việc gấp vừa xảy ra nên ngày mai tôi không thể tới gặp bạn được. Chúng ta có thể hẹn vào ngày khác được không?)</em></p></div>",
    "page": 3
  }
]