[
  {
    "id": 37,
    "title": "Cách dùng Although, Though, Even though, Despite và In Spite of",
    "a_href": "https://tienganhtflat.com/blog/cach-dung-although-even-though-despite-va-in-spite-of",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/although2-ccdcd280f1-d6e2c172bcade6cbd0f72deea419ebb4.jpg",
    "viewer": "118,596",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p><strong>1. Despite và In spite of  đều là giới từ thể hiện sự tương phản.</strong></p><p><span style=\"color:#0000FF\">Ví dụ:</span><br/>\nMary went to the carnival despite the rain.<br/>\nMary went to the carnival in spite of the rain.<br/><em>( Mary đã đi đến lễ hội bất chấp trời mưa.)</em><br/><br/>\nDespite có thể được coi là một sự thay đổi đi một chút của In spite of  và được dùng phổ biến hơn trong văn viết tiếng Anh. <br/>\n </p><p><strong>2. Despite và In spite of đều là từ trái nghĩa của because of.</strong><br/><br/><span style=\"color:#0000CD\">Ví dụ:</span><br/>\nJulie loved Tom in spite of his football obsession<br/>\n(<em>Julie đã yêu Tom bất chấp nỗi ám ảnh bóng đá của anh ấy.)</em></p><p>Julie loved Tom because of his football obsession<br/><em>(Julie đã yêu Tom vì nỗi ám ảnh bóng đá của anh ta.)</em><br/><br/><strong>3. Despite và in spite of đứng trước một danh từ, đại từ (this, that, what…) hoặc V-ing.</strong><br/>\n </p><p><span style=\"color:#0000FF\">Ví dụ:</span> despite và in spite of đứng trước danh từ.<br/>\n- I woke up feeling refreshed despite Dave calling at midnight.<br/>\nI woke up feeling refreshed in spite of Dave calling at midnight.<br/><em>(Tôi đã đánh thức cảm giác được gợi lại dù Dave gọi lúc nửa đêm.)</em><br/><br/><span style=\"color:#0000CD\">Ví dụ:</span>  despite và in spite of đứng trước đại từ.<br/>\n- I want to go for a run despite this rain.<br/>\nI want to go for a run in spite of this rain.<br/><em>(Tôi muốn đi như bay mặc cho trời mưa.)</em><br/><br/><span style=\"color:#0000FF\">Ví dụ:</span> despite và in spite of đứng trước V-ing.<br/>\n- Despite eating McDonalds regularly Mary remained slim.<br/>\nIn spite of eating McDonalds regularly Mary remained slim.<br/><em>(Mặc dù thường xuyên ăn McDonalds nhưng Mary vẫn thon thả.)</em><br/><br/>\n <strong>4. Cả despite và in spite of thường đứng trước the fact. </strong><br/><span style=\"color:rgb(4, 23, 66); font-family:arial\">Sử dụng in spite of và despite với với một mệnh đề bao gồm cả chủ ngữ và vị ngữ nếu như đứng trước “the fact that”.</span><br/><br/><span style=\"color:#0000FF\">Ví dụ:</span><br/>\nMary bought a new pair of shoes despite the fact that she already had 97 pairs.<br/>\nMary went to the cinema in spite of the fact that she was exhausted.<br/><em>(Mary đã mua một đôi giầy mới mặc dù thực tế rằng cô ấy đã có 97 đôi rồi.)</em><br/><br/><strong>5. Cả despite và in spite of có thể được dùng ở mệnh đề đầu hoặc mệnh đề thứ hai đều được.</strong><br/><br/><span style=\"color:#0000FF\">Ví dụ:</span><br/>\nShe liked ice cream despite having sensitive teeth.<br/>\nDespite having sensitive teeth, she went liked ice cream.<br/><em>(Cô ấy thích ăn kem mặc dù răng dễ bị hỏng.)</em><br/><br/>\nSự khác nhau giữa hai câu này ở chỗ, câu đầu nhấn mạnh thông tin về việc thích kem, còn câu hai thì nhấn mạnh vào thông tin răng dễ hỏng.<br/><br/><span style=\"color:#B22222\"><u><em><strong>Although, Though và Even though</strong></em></u></span></p><p>Although, though và even though có thể dùng để thay thế cho despite và in spite of nhưng về mặt cấu trúc ngữ pháp thì có khác biệt.</p><p><strong>1. Although / though / even though đứng ở đầu câu hoặc giữa hai mệnh đề</strong><br/><br/><span style=\"color:#0000FF\">Ví dụ:</span><br/>\nAlthough / Though /Even thoughher job is hard, her salary is low.<br/><em>(Mặc dù công việc vất vả nhưng lương của cô ấy lại thấp)</em><br/><br/><strong>2. Although / though / even though đều có cùng nghĩa nhưng though khi đứng ở đầu câu giúp câu nói trang trọng hơn so với khi nó đứng giữa hai mệnh đề. even though mang nghĩa nhấn mạnh hơn.)</strong></p><p><span style=\"color:#0000FF\">Ví dụ:</span><br/>\nHer salary is low, although / though / even though her job is hard<br/><em>(Lương của cô ấy thấpmặc dù công việc vất vả) </em></p><p><strong>3. Although: Sau although chúng ta sử dụng mệnh đề gồm chủ ngữ và động từ</strong></p><p><span style=\"color:#0000FF\">Ví dụ:</span></p><p>We enjoyed our camping holiday although it rained every day.<br/><em>(Chúng tôi vui vẻ cắm trại cho dù ngày nào trời cũng mưa.)</em></p><p>Although he worked very hard, he didn’t manage to pass the exam.<br/><em>(Cho dù học chăm nhưng cậu ấy vẫn không thể qua nổi kỳ thi,)</em></p><p>The holiday was great although the hotel wasn’t very nice.<br/><em>(Kỳ nghỉ rất tuyệt cho dù khách sạn không được tốt lắm).</em></p><p><strong>4. Even though: Giống như although, even though cũng được theo sau bởi một mềnh đề gồm chủ ngữ và động từ.</strong></p><p>Even though có sắc thái ý nghĩa mạnh hơn although</p><p><span style=\"color:#0000FF\">Ví dụ:</span><br/>\nWe decided to buy the house even though we didn’t really have enough money.<br/><em>(Chúng tôi vẫn mua nhà cho dù chúng tôi thực sự không có đủ tiền.)</em></p><p>You keep making that stupid noise even though I’ve asked you to stop three times.<br/><em>(Cậu vẫn tiếp tục tạo ra những âm thanh ngu ngốc cho dù tôi đã nhắc nhở cậu ba lần rồi.)</em></p><p><strong>5. Though</strong></p><p><strong>Đôi khi chúng ta dùng THOUGH thay cho although, cấu trúc câu vẫn không thay đổi</strong><br/><br/><span style=\"color:#0000FF\">Ví dụ:</span><br/>\nex:I didn't get a job though I had all the necessary qualifications<br/><em>( Tôi không nhận được công việc đó mặc dù tôi có tất cả những bằng cấp cần thiết)</em></p><p><strong>Trong văn nói tiếng anh, chúng ta thường dùng THOUGH ở cuối câu</strong></p><p><span style=\"color:#0000FF\">Ví dụ:</span><br/>\nThe house isn't very nice. I like the garden though<br/><em>(Căn nhà không đẹp lắm nhưng thôi thích khu vườn)</em></p></div>",
    "page": 3
  },
  {
    "id": 38,
    "title": "84 CẤU TRÚC CÂU TRONG TIẾNG ANH",
    "a_href": "https://tienganhtflat.com/blog/84-cau-truc-cau-trong-tieng-anh",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/hgsauycgauy-9a5e09344f-d6e2c172bcade6cbd0f72deea419ebb4.png",
    "viewer": "41,564",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p>              <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/2365.png?1476355804973\"/></p><p><strong>1. S + V + too + adj/adv + (for someone) + to do something: (quá....để cho ai làm gì...)</strong><br/>\ne.g. This structure is too easy for you to remember. (Cấu trúc này quá dễ cho bạn để nhớ)<br/>\ne.g. He ran too fast for me to follow. (Anh ấy chạy quá nhanh để tôi chạy theo)</p><p><br/><strong>2. S + V + so + adj/ adv + that + S + V: ( quá... đến nỗi mà... )</strong><br/>\ne.g. This box is so heavy that I cannot take it. (Chiếc hộp này quá nặng đến nỗi tôi không thể mang nó lên được)<br/>\ne.g. He speaks so soft that we can’t hear anything. (Anh ấy nói quá nhỏ đến nỗi chúng tôi không thể nghe được gì)<br/><br/><strong>3. It + V + such + (a/an) + N(s) + that + S + V: (quá... đến nỗi mà... )</strong><br/>\ne.g. It is such a heavy box that I cannot take it. (Chiếc hộp này quá nặng đến nỗi tôi không thể mang nó lên được)<br/>\ne.g. It is such interesting books that I cannot ignore them at all. (Những cuốn sách này quá thú vị đến nỗi mà tối không thể phớt lờ chúng được)<br/><br/><strong>4. S + V + adj/ adv + enough + (for someone) + to do something : (Đủ... cho ai đó làm gì... )</strong><br/>\ne.g. She is old enough to get married. (Cô ấy đã đủ tuổi để kết hôn)<br/>\ne.g. They are intelligent enough for me to teach them English. (Họ đủ thông minh để tôi dạy tiếng anh cho họ)<br/><br/><strong>5. Have/ get + something + done (past participle): (nhờ ai hoặc thuê ai làm gì... )</strong><br/>\ne.g. I had my hair cut yesterday. (Tôi đã đi cắt tóc hôm qua)<br/><br/><strong>6. It + be + time + S + V (-ed, cột 2) / It’s +time +for someone +to do something : ( đã đến lúc ai đó phải làm gì... )<br/>\ne.g. It is time you had a shower. (Đã đến lúc bạn đi tắm)</strong><br/>\ne.g. It’s time for me to ask all of you for this question. (Đã đến lúc tôi hỏi tất cả các bạn câu hỏi này)<br/><br/><strong>7. It + takes/took+ someone + amount of time + to do something: ( làm gì... mất bao nhiêu thời gian... )</strong><br/>\ne.g. It takes me 5 minutes to get to school. (Tôi mất 5 phút để đi học)<br/>\ne.g. It took him 10 minutes to do this exercise yesterday. (Anh ấy mất 10 phút để làm bài tập ngày hôm qua)<br/><br/><strong>8. To prevent/stop + someone/something + From + V-ing: ( ngăn cản ai/ cái gì... làm gì.. )</strong><br/>\ne.g. He prevented us from parking our car here. (Anh ấy ngăn chúng tôi đỗ xe tại đây)<br/><br/><strong>9. S + find+ it+ adj to do something: ( thấy ... để làm gì... )</strong><br/>\ne.g. I find it very difficult to learn about English. (Tôi thấy học tiếng Anh quá khó)<br/>\ne.g. They found it easy to overcome that problem. (Họ thấy vượt qua vấn đề này khá dễ dàng)<br/><br/><strong>10. To prefer + Noun/ V-ing + to + N/ V-ing. ( Thích cái gì/ làm gì hơn cái gì/ làm gì )</strong><br/>\ne.g. I prefer dog to cat. (Tôi thích chó hơn mèo) <br/>\ne.g. I prefer reading books to watching TV. (Tôi thích đọc sách hơn xem TV)<br/><br/><strong>11. Would rather ('d rather) + V (infinitive) + than + V (infinitive: ( thích làm gì hơn làm gì )</strong><br/>\ne.g. She would play games than read books. (Cô ấy thích chơi điện tử hơn đọc sách)<br/>\ne.g. I’d rather learn English than learn Biology. (Tôi thích học Tiếng anh hơn môn sinh học)<br/><br/><strong>12. To be/get Used to + V-ing: ( quen làm gì )</strong><br/>\ne.g. I am used to eating with chopsticks. (Tôi quen với việc dùng đũa để ăn)<br/><br/><strong>13. Used to + V (infinitive): ( Thường làm gì trong qk và bây giờ không làm nữa )</strong><br/>\ne.g. I used to go fishing with my friend when I was young. (Tôi từng đi câu cá với bạn khi tôi còn trẻ)<br/>\ne.g. She used to smoke 10 cigarettes a day. (Cô ấy tương hút 10 điếu xì gà 1 ngày)<br/><br/><strong>14. To be amazed at = to be surprised at + N/V-ing: ( ngạc nhiên về... )</strong><br/>\ne.g. I was amazed at his big beautiful villa. (Tôi rất ngạc nhiên về căn biệt thự rất đẹp của anh ấy)<br/><br/><strong>15. To be angry at + N/V-ing: ( tức giận về )</strong><br/>\ne.g. Her mother was very angry at her bad marks. (Mẹ cô ấy đã rất tức giận về những điểm kém của cô ấy)<br/><br/><strong>16. to be good at/ bad at + N/ V-ing: ( giỏi về.../ kém về... )</strong><br/>\ne.g. I am good at swimming. (Tôi bơi rất giỏi)<br/>\ne.g. He is very bad at English. (Anh ấy rất kém về Tiếng anh)<br/><br/><strong>17. by chance = by accident (adv): ( tình cờ )</strong><br/>\ne.g. I met her in Paris by chance last week. (Tôi tình cờ gặp cô ấy tại Pari tuần trước)<br/><br/><strong>18. to be/get tired of + N/V-ing: ( mệt mỏi về... )</strong><br/>\ne.g. My mother was tired of doing too much housework everyday. (Mẹ tôi quá mệt mỏi vì việc nhà mỗi ngày)<br/><br/><strong>19. can’t stand/ help/ bear/ resist + V-ing: ( Không chịu nỗi/không nhịn được làm gì... )</strong><br/>\ne.g. She can't stand laughing at her little dog. (Cô ấy không thể nhịn cười với con chó của cô ấy)<br/><br/><strong>20. to be keen on/ to be fond of + N/V-ing : ( thích làm gì đó... )</strong><br/>\ne.g. My younger sister is fond of playing with her dolls. (Em gái tôi thích chơi búp bê)<br/><br/><strong>21. to be interested in + N/V-ing: ( quan tâm đến... )</strong><br/>\ne.g. Mrs Brown is interested in going shopping on Sundays. (Bà Brown quan tâm đến việc đi mua sắm vào mỗi Chủ nhật)<br/><br/><strong>22. to waste + time/ money + V-ing: ( tốn tiền hoặc thời gian làm gì )</strong><br/>\ne.g. He always wastes time playing computer games each day. (Anh ấy luôn tốn thời gian dể chơi điện tử mỗi ngày)<br/>\ne.g. Sometimes, I waste a lot of money buying clothes. (Thỉnh thoảng, tôi tiêu tốn tiền bạc vào việc mua quần áo)<br/><br/><strong>23. To spend + amount of time/ money + V-ing: ( dành bao nhiêu thời gian/ tiền bạc làm gì... )</strong><br/>\ne.g. I spend 2 hours reading books a day. (Tôi dành 2 giờ để đọc sách mỗi ngày)<br/>\ne.g. Mr Jim spent a lot of money traveling around the world last year. (Ngài Jim dành nhiều tiền vào việc đi du lịch vòng quanh Thế giới vào năm ngoái)<br/><br/><strong>24. To spend + amount of time/ money + on + something: ( dành thời gian/tiền bạc vào việc gì... )</strong><br/>\ne.g. My mother often spends 2 hours on housework everyday. (Mẹ tối dành 2 giờ mỗi ngày để làm việc nhà)<br/>\ne.g. She spent all of her money on clothes. (Cô ấy dành tất cả tiền vào quần áo)<br/><br/><strong>25. to give up + V-ing/ N: ( từ bỏ làm gì/ cái gì... )</strong><br/>\ne.g. You should give up smoking as soon as possible. (Bạn nên từ bỏ việc hút thuốc sớm nhất có thể)<br/><br/><strong>26. would like/ want/wish + to do something: ( thích làm gì... )</strong><br/>\ne.g. I would like to go to the cinema with you tonight. (Tôi thích đi xem phim với bạn tối nay)<br/><br/><strong>27. have + (something) to + Verb: ( có cái gì đó để làm )</strong><br/>\ne.g. I have many things to do this week. (Tôi có nhiều việc để làm trong tuần này)<br/><br/><strong>28. It + be + something/ someone + that/ who: ( chính...mà... )</strong><br/>\ne.g. It is Tom who got the best marks in my class. (Đó chính là Tom người có nhiều điểm cao nhất lớp tôi)<br/>\ne.g. It is the villa that he had to spend a lot of money last year. (Đó chính là biệt thự mà anh ấy dành tiền để mua năm ngoái)<br/><br/><strong>29. Had better + V(infinitive): ( nên làm gì... ).</strong><br/>\ne.g. You had better go to see the doctor. (bạn nên đến gặp bác sĩ)<br/><br/><strong>30. hate/ like/ dislike/ enjoy/ avoid/ finish/ mind/ postpone/ practise/ consider/ delay/ deny/ suggest/ risk/ keep/ imagine/ fancy + V-ing</strong><br/>\ne.g. I always practise speaking English everyday. (Tôi luôn thực hành nói tiếng anh mỗi ngày)<br/><br/><strong>31. It is + tính từ + ( for smb ) + to do smt : ( khó để làm gì ) </strong><br/>\ne.g. It is difficult for old people to learn English. (Người có tuổi học tiếng Anh thì khó)<br/><br/><strong>32. To be interested in + N / V_ing ( Thích cái gì / làm cái gì )</strong><br/>\ne.g. We are interested in reading books on history. (Chúng tôi thích đọc sách về lịch sử)<br/><br/><strong>33. To be bored with ( Chán làm cái gì )</strong><br/>\ne.g. We are bored with doing the same things everyday. (Chúng tôi chán ngày nào cũng làm những công việc lặp đi lặp lại)<br/><br/><strong>34. It’s the first time smb have ( has ) + PII smt ( Đây là lần đầu tiên ai làm cái gì )</strong><br/>\ne.g. It’s the first time we have visited this place. (Đây là lần đầu tiên chúng tôi tới thăm nơi này)<br/><br/><strong>35. enough + danh từ ( đủ cái gì ) + ( to do smt )</strong><br/>\ne.g. I don’t have enough time to study. (Tôi không có đủ thời gian để học)<br/><br/><strong>36. Tính từ + enough (đủ làm sao ) + ( to do smt )</strong><br/>\ne.g. I’m not rich enough to buy a car. (Tôi không đủ giàu để mua ôtô)<br/><br/><strong>37. too + tính từ + to do smt ( Quá làm sao để làm cái gì )</strong><br/>\ne.g. I’m to young to get married. (Tôi còn quá trẻ để kết hôn)<br/><br/><strong>38. To want smb to do smt = To want to have smt + PII<br/>\n( Muốn ai làm gì ) ( Muốn có cái gì được làm )</strong><br/>\ne.g. She wants someone to make her a dress. (Cô ấy muốn ai đó may cho cô ấy một chiếc váy)<br/>\n= She wants to have a dress made. (Cô ấy muốn có một chiếc váy được may)<br/><br/><strong>39. It’s time smb did smt ( Đã đến lúc ai phải làm gì )</strong><br/>\ne.g. It’s time we went home. (Đã đến lúc tôi phải về nhà)<br/><br/><strong>40. It’s not necessary for smb to do smt = Smb don’t need to do smt</strong><br/>\n( Ai không cần thiết phải làm gì ) doesn’t have to do smt<br/>\ne.g. It is not necessary for you to do this exercise. (Bạn không cần phải làm bài tập này)<br/><br/><strong>41. To look forward to V_ing ( Mong chờ, mong đợi làm gì )</strong><br/>\ne.g. We are looking forward to going on holiday. (Chúng tôi đang mong được đi nghỉ)<br/><br/><strong>42. To provide smb from V_ing ( Cung cấp cho ai cái gì )</strong><br/>\ne.g. Can you provide us with some books in history? (Bạn có thể cung cấp cho chúng tôi một số sách về lịch sử không?)<br/><br/><strong>43. To prevent smb from V_ing (Cản trở ai làm gì )<br/>\n     To stop</strong><br/>\ne.g. The rain stopped us from going for a walk. (Cơn mưa đã ngăn cản chúng tôi đi dạo)<br/><br/><strong>44. To fail to do smt (Không làm được cái gì / Thất bại trong việc làm cái gì)</strong><br/>\ne.g. We failed to do this exercise. (Chúng tôi không thể làm bài tập này)<br/><br/><strong>45. To be succeed in V_ing (Thành công trong việc làm cái gì)</strong><br/>\ne.g. We were succeed in passing the exam. (Chúng tôi đã thi đỗ)<br/><br/><strong>46. To borrow smt from smb (Mượn cái gì của ai)</strong><br/>\ne.g. She borrowed this book from the liblary. (Cô ấy đã mượn cuốn sách này ở thư viện)<br/><br/><strong>47. To lend smb smt (Cho ai mượn cái gì)</strong><br/>\ne.g. Can you lend me some money? (Bạn có thể cho tôi vay ít tiền không?)<br/><br/><strong>48. To make smb do smt (Bắt ai làm gì)</strong><br/>\ne.g. The teacher made us do a lot of homework. (Giáo viên bắt chúng tôi làm rất nhiều bài tập ở nhà)<br/><br/><strong>49. CN + bé + số + tính từ + thật + S + động từ. ( Đến mức mà )</strong></p><p><strong>CN + động từ + so + trạng từ</strong><br/>\ne.g -The exercise is so difficult that noone can do it. (Bài tập khó đến mức không ai làm được)<br/>\ne.g. -He spoke so quickly that I couldn’t understand him. (Anh ta nói nhanh đến mức mà tôi không thể hiểu được anh ta)<br/><br/><strong>50. CN + be + such + ( tính từ ) + danh từ + that + CN + động từ.</strong><br/>\ne.g. It is such a difficult exercise that noone can do it. (Đó là một bài tập quá khó đến nỗi không ai có thể làm được)<br/><br/><strong>51. It is ( very ) kind of smb to do smt ( Ai thật tốt bụng / tử tế khi làm gì)</strong><br/>\ne.g. It is very kind of you to help me. (Bạn thật tốt vì đã giúp tôi)<br/><br/><strong>52. To find it + tính từ + to do smt</strong><br/>\ne.g. We find it difficult to learn English. (Chúng tôi thấy học tiếng Anh khó)<br/><br/><strong>53. To make sure of smt ( Bảo đảm điều gì ) that + CN + động từ</strong><br/>\ne.g. -I have to make sure of that information. (Tôi phải bảo đảm chắc chắn về thông tin đó)<br/>\ne.g. -You have to make sure that you’ll pass the exam. (Bạn phải bảo đảm là bạn sẽ thi đỗ)<br/><br/><strong>54. It takes ( smb ) + thời gian + to do smt ( Mất ( của ai ) bao nhiêu thời gian để làm gì)</strong><br/>\ne.g. It took me an hour to do this exercise. (Tôi mất một tiếng để làm bài này)<br/><br/><strong>55. To spend + time / money + on smt ( Dành thời gian / tiền bạc vào cái gì)/doing smt làm gì</strong> <br/>\ne.g. We spend a lot of time on TV/watching TV. (Chúng tôi dành nhiều thời gian xem TV)<br/><br/><strong>56. To have no idea of smt = don’t know about smt ( Không biết về cái gì )</strong><br/>\ne.g. I have no idea of this word = I don’t know this word. (Tôi không biết từ này)<br/><br/><strong>57. To advise smb to do smt ( Khuyên ai làm gì/not to do smt không làm gì)</strong><br/>\ne.g. Our teacher advises us to study hard. (Cô giáo khuyên chúng tôi học chăm chỉ)<br/><br/><strong>58. To plan to do smt ( Dự định / có kế hoạch làm gì)</strong><br/>\ne.g. We planed to go for a picnic. (Chúng tôi dự định đi dã ngoại)<br/><br/><strong>59. To invite smb to do smt ( Mời ai làm gì )</strong><br/>\ne.g. They invited me to go to the cinema. (Họ mời tôi đi xem phim)<br/><br/><strong>60. To offer smb smt ( Mời / đề nghị ai cái gì )</strong><br/>\ne.g. He offered me a job in his company. (Anh ta mời tôi làm việc cho công ty anh ta)<br/><br/><strong>61. To rely on smb ( tin cậy, dựa dẫm vào ai )</strong><br/>\ne.g. You can rely on him. (Bạn có thể tin anh ấy)<br/><br/><strong>62. To keep promise ( Giữ lời hứa )</strong><br/>\ne.g. He always keeps promises. (Anh ấy luôn giữ lời hứa)<br/><br/><strong>63. To be able to do smt = To be capable of + V_ing ( Có khả năng làm gì )</strong><br/>\ne.g. I’m able to speak English = I am capable of speaking English. (Tôi có thể nói tiếng Anh)<br/><br/><strong>64. To be good at ( + V_ing ) smt ( Giỏi ( làm ) cái gì )</strong><br/>\ne.g. I’m good at ( playing ) tennis. (Tôi chơi quần vợt giỏi)<br/><br/><strong>65. To prefer smt to smt ( Thích cái gì hơn cái gì ) /doing smt to doing smt: làm gì hơn làm gì</strong><br/>\ne.g. We prefer spending money than earning money. (Chúng tôi thích tiêu tiền hơn kiếm tiền)<br/><br/><strong>66. To apologize for doing smt ( Xin lỗi ai vì đã làm gì )</strong><br/>\ne.g. I want to apologize for being rude to you. (Tôi muốn xin lỗi vì đã bất lịch sự với bạn)<br/><br/><strong>67. Had ( ‘d ) better do smt ( Nên làm gì )/ not do smt ( Không nên làm gì )</strong><br/>\ne.g. -You’d better learn hard. (Bạn nên học chăm chỉ)<br/>\ne.g. -You’d better not go out. (Bạn không nên đi ra ngoài)<br/><br/><strong>68. Would ( ‘d ) rather do smt (Thà làm gì )/ not do smt đừng làm gì</strong><br/>\ne.g. I’d rather stay at home.(Tôi thà ở nhà còn hơn)</p><p><strong>69. Would ( ‘d ) rather smb did smt ( Muốn ai làm gì )</strong><br/>\ne.g. I’d rather you ( he / she ) stayed at home today.(Tôi muốn bạn / anh ấy / cô ấy ở nhà tối nay)<br/><br/><strong>70. To suggest smb ( should ) do smt ( Gợi ý ai làm gì )</strong><br/>\ne.g. I suggested she ( should ) buy this house.(Tôi gợi ý cô ấy nên mua căn nhà này)<br/><br/><strong>71. To suggest doing smt ( Gợi ý làm gì )</strong><br/>\ne.g. I suggested going for a walk.(Tôi gợi ý nên đi bộ)<br/><br/><strong>72. Try to do ( Cố làm gì )</strong><br/>\ne.g. We tried to learn hard.(Chúng tôi đã cố học chăm chỉ)<br/><br/><strong>73. Try doing smt ( Thử làm gì )</strong><br/>\ne.g. We tried cooking this food.(Chúng tôi đã thử nấu món ăn này)<br/><br/><strong>74. To need to do smt ( Cần làm gì )</strong><br/>\ne.g. You need to work harder.(Bạn cần làm việc tích cực hơn)<br/><br/><strong>75. To need doing ( Cần được làm )</strong><br/>\ne.g. This car needs repairing.(Chiếc ôtô này cần được sửa)<br/><br/><strong>76. To remember doing ( Nhớ đã làm gì )</strong><br/>\ne.g. I remember seeing this film.(Tôi nhớ là đã xem bộ phim này)<br/><br/><strong>77. To remember to do ( Nhớ làm gì ) ( chưa làm cái này )</strong><br/>\ne.g. Remember to do your homework.(Hãy nhớ làm bài tập về nhà)<br/><br/><strong>78. To have smt + PII ( Có cái gì được làm )</strong><br/>\ne.g. I’m going to have my house repainted.(Tôi sẽ sơn lại nhà người khác sơn, không phải mình sơn lấy)</p><p><strong>=To have smb do smt ( Thuê ai làm gì ) Biology = I’m going to have my car repaired.</strong><br/>\ne.g. I’m going to have the garage repair my car.(Tôi thuê ga-ra để sửa xe)<br/><br/><br/><strong>79. To be busy doing smt ( Bận rộn làm gì )</strong><br/>\ne.g. We are busy preparing for our exam.(Chúng tôi đang bận rộn chuẩn bị cho kỳ thi)<br/><br/><strong>80. To mind doing smt ( Phiền làm gì )</strong><br/>\ne.g. Do / Would you mind closing the door for me?(Bạn có thể đóng cửa giúp tôi không?)<br/><br/><strong>81. To be used to doing smt ( Quen với việc làm gì )</strong><br/>\ne.g. We are used to getting up early.(Chúng tôi đã quen dậy sớm)<br/><br/><strong>82. To stop to do smt ( Dừng lại để làm gì )</strong><br/>\ne.g. We stopped to buy some petrol.(Chúng tôi đã dừng lại để mua xăng)<br/><br/><strong>83. To stop doing smt ( Thôi không làm gì nữa )</strong><br/>\ne.g. We stopped going out late.(Chúng tôi thôi không đi chơi khuya nữa)<br/><br/><strong>84. Let smb do smt ( Để ai làm gì )</strong><br/>\ne.g. Let him come in.(Để anh ta vào)</p></div>",
    "page": 3
  },
  {
    "id": 39,
    "title": "CẤU TRÚC V-ing THÔNG DỤNG",
    "a_href": "https://tienganhtflat.com/blog/cau-truc-v-ing-thong-dung",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/untitled-104-34b58aa6e1-688df2cb4ef0eac72f93add37ef1ff12.png",
    "viewer": "6,328",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p><img alt=\"CẤU TRÚC V-ing THÔNG DỤNG\" src=\"/uploads/blog/untitled-104-34b58aa6e1.png\"/></p><p></p><p> <b>Dislike doing something</b><i class=\"means\">(không thích làm gì)</i></p><p> <b>Dread doing something</b><i class=\"means\">(sợ phải làm gì)</i></p><p> <b>Endure doing something</b><i class=\"means\">(chịu đựng phải làm gì)</i></p><p> <b>Quit doing something</b><i class=\"means\">(từ bỏ làm cái gì đó)</i></p><p> <b>Go on doing something</b><i class=\"means\">(tiếp tục làm gì đó)</i></p><p> <b>Imagine doing something</b><i class=\"means\">(tưởng tượng làm gì)</i></p><p> <b>Invovle doing something</b><i class=\"means\">(đòi hỏi phải làm gì đó)</i></p><p> <b>Miss doing something</b><i class=\"means\">(suýt đã làm gì)</i></p><p> <b>Postpone doing something</b><i class=\"means\">(trì hoãn làm gì)</i></p><p> <b>Remember doing something</b><i class=\"means\">(nhớ đã làm gì)</i></p></div>",
    "page": 3
  },
  {
    "id": 40,
    "title": "Sự khác nhau giữa \"between\" và \"among\"",
    "a_href": "https://tienganhtflat.com/blog/su-khac-nhau-giua-between-va-among",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/between-among_57fdb57a9436c-688df2cb4ef0eac72f93add37ef1ff12.jpg",
    "viewer": "13,691",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p><strong>1. Giới từ \"between\" có 6 nét nghĩa chính như sau:</strong></p><table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td>Tại, trong, hay giữa khoảng cách giữa hai người hay hai vật </td><td><p>- He was standing between Jeff and Kevin<br/><em>(Anh ấy đứng giữa Jeff và Kenvin)</em><br/>\n- \"There’s a high-speed train service between New York and Washington<br/><em>(Có dịch vụ tàu tốc hành giữa New York và Washington)</em></p></td></tr><tr><td>Trong khoảng thời gian phân chia hai ngày, hai sự kiện</td><td>- Many changes took place between the two world wars<br/><em>(Nhiều thay đổi xảy ra trong khoản thời gian hai cuộc chiến tranh)</em></td></tr><tr><td>Nằm trong khoảng thời gian phân chia hai điểm được tính một cách ước lượng</td><td>- Her sons, aged between 5 and 9, go to primary school<br/><em>(Các con trai của cô ấy, từ 5 đến 9 tuổi, đi học tiểu học)</em></td></tr><tr><td>Dùng để chỉ mối quan hệ, sự lựa chọn, sự khác nhau....</td><td>- You have to choose between two or three different options<br/><em>(Bạn phải lựa chọn giữa 2 hoặc 3 sự lựa chọn khác nhau)</em><br/>\n- Talks between France and Germany are continuing<br/><em>(Cuộc đàm phán giữa Pháp và Đức đang diễn ra)</em></td></tr><tr><td>Được chia sẻ bởi một số người hoặc vật</td><td>- They ate the whole birthday cake between them<br/><em>(Họ đã cùng nhau ăn toàn bộ chiếc bánh sinh nhật)</em></td></tr><tr><td>Nhắc đến một tập hợp hành động hoặc nguồn gốc của người/vật</td><td>- We’ve created something between us.<br/><em>(Chúng tôi đã tự tạo ra khoảng cách giữa chúng tôi)</em></td></tr></tbody></table><p> </p><p><strong>2. Giới từ \"Among/amongst\" có 3 nghĩa chính:</strong></p><table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td>Được bao quanh hoặc nằm trong một nhóm người hoặc vật</td><td>- Surrounded by or within a group of people or things, we walked among hundreds of bluebells<br/><em>(Được bao quanh bởi một nhóm người và vật, chúng tôi đi bộ giữa hàng trăm chiếc chuông xanh)</em></td></tr><tr><td>Thuộc về một nhóm hoặc sự việc xảy ra bên trong một nhóm</td><td>- A British woman was among the 20 victims of the crash<br/><em>(Có một người phụ nữ người Anh trong số 20 nạn nhân của vụ nổ)</em></td></tr><tr><td>Dùng để biểu thị một mối quan hệ, sự lựa chọn, sự phân chia.... khi có nhiều hơn ba người hoặc vật liên quan.</td><td>- He divided his fortune among his four children<br/><em>(Anh ấy chia tài sản của mình cho 4 đứa con của mình)</em></td></tr></tbody></table><p>Nét nghĩa thứ tư của between và thứ tư của among khá tương đồng nhau. Nhiều người cho rằng trong trường hợp hai người hoặc vật, chúng ta dùng \"between\", khi có ba người hoặc vật trở lên, chúng dùng \"among\".</p><p>VD:</p><p>- I had to choose between the two jobs.</p><p>- The complex has 270 units, divided between two interior plazas.</p><p>- Gallery-goers can pick and choose among the DVDs and watch various moments.</p><p>- The grant will be divided among all the institutions.</p><p>Mặc dù vậy, quy tắc này dường như khá lạc hậu trong ngôn ngữ hiện đại. Từ điển Oxford English Dictionary khẳng định \"between\" có thể dùng khi có nhiều hơn hai đối tượng. Từ điển Oxford ví dụ hai trường hợp sau đều đúng:</p><p>✔ He divided his fortune between his four children.</p><p>✔ He divided his fortune among his four children</p><p><strong>3. Những lưu ý khi chọn \"between\" và \"among\" (✔=đúng, X=sai) :</strong></p><table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td>1. Luôn dùng \"between\", không phải \"among\" nếu bạn muốn nói về một vị trí,<br/>\nthời điểm cụ thể giữa hai mốc cụ thể:</td><td><p>✔ The children were aged between 12 and 16. =&gt; đúng<br/><em>(Những đứa trẻ từ 12 đến 16 tuổi )</em></p><p>X The children were aged among 12 and 16. =&gt; sai</p></td></tr><tr><td>2. Chọn \"between\" nếu bạn đang đề cập đến con số hay danh từ cụ thể</td><td><p>✔ A treaty was drawn up between France, Germany, Italy, and Greece. =&gt; đúng<br/><em>(Một hiệp ước đã được kí kết giữa Pháp, Đức, Ý và Hi lạp)</em></p><p>X A treaty was drawn up among France, Germany, Italy, and Greece. =&gt; sai</p><p>✔ Flights between London and Crete begin in early April. =&gt; đúng<br/><em>(Các chuyến bay giữa Luân Đôn và Crete bắt đầu vào tháng 4)</em></p><p>X Flights among London and Crete begin in early April. =&gt; sai</p></td></tr><tr><td>3. Dùng \"among\" nếu người hoặc vật được nhắc đến mang tính gộp<br/>\n(được xem như một nhóm) hơn là nhắc đến từng người/vật riêng lẻ</td><td><p>✔ There was agreement among members that fees should not be raised. =&gt; đúng <br/><em>(Một hiệp định đã được kí giữa các thành viên về việc không tăng phí)</em></p><p>X There was agreement between members that fees should not be raised. =&gt; sai</p><p>✔ The Petronas Towers are among the architectural wonders of the world. =&gt; đúng <br/><em>( Tòa tháp Petronas nằm giữa các kì quan kiến trúc thế giới)</em></p><p>X The Petronas Towers are between the architectural wonders of the world. =&gt; sai</p></td></tr><tr><td>4. \"Between\" được ưa dùng hơn nếu nói về sự khác nhau giữa các<br/>\nmối quan hệ, bất kể có bao nhiều người/vật được đề cập.</td><td><p>✔ The difference between those results is not statistically significant. =&gt; đúng <br/><em>(Sự khác nhau giữa các kết quả là không đáng kể)</em></p><p>X The difference among those results is not statistically significant. =&gt; sai</p></td></tr></tbody></table><p style=\"text-align:right\"><strong>Tổng hợp</strong></p></div>",
    "page": 3
  },
  {
    "id": 41,
    "title": "Đảo ngữ với ONLY",
    "a_href": "https://tienganhtflat.com/blog/dao-ngu-voi-only",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/maxresdefault_57fc8b1f796d4-9e3d1457eb21ca3fc81a23be84056b5b.jpg",
    "viewer": "17,539",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p>1/ <strong>Only in + adv of time/ place</strong>: chỉ thời gian/ địa điểm</p><p>Ex: Only in central Vietnam have I seen such scenery like that.</p><p><em>Chỉ ở miền Trung Việt Nam tôi mới thấy cảnh như thế.</em></p><p>2/ <strong>Only after + Noun/ clause</strong>: chỉ sau khi</p><p>Ex: Only afer all guests had gone home, could we relax.</p><p><em>Chỉ sau khi tất cả khách về nhà, chúng tôi mới có thể nghỉ ngơi.</em></p><p>3/ <strong>Only when + Clause</strong>: chỉ đến khi = Not until</p><p>Ex: Only when he is here, does he speak English.</p><p><em>Chỉ đến khi ông ta ở đây, ông ta mới biết nói tiếng Anh.</em></p><p>4/ <strong>Only then</strong>: chỉ đến lúc đó</p><p>Ex: Only then did I understand the problem.</p><p><em>Chỉ một lúc sau tôi đã hiểu được vấn đề.</em></p><p>5/ <strong>Only by + Ving/ Noun</strong>: chỉ bằng cách</p><p>Ex: Only by practicing English every day can you speak it fluently</p><p><em>Chỉ bằng cách luyện tập tiếng Anh hàng ngày bạn mới có thể nói trôi chảy được</em></p><p>6/ <strong>Only with + Noun</strong>: chỉ với</p><p>Ex: Only with the full agreement of everyone can we hope to succeed.</p><p><em>Chỉ với sự đồng ý của tất cả mọi người thì chúng ta mới có hy vọng thành công.</em></p></div>",
    "page": 3
  },
  {
    "id": 42,
    "title": "PHÂN BIỆT \"MISS\" VÀ \"REMEMBER\"",
    "a_href": "https://tienganhtflat.com/blog/phan-bit-miss-va-remember",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/miss-477ffb486c-c3ef6124e6c388ffb0a969b6955596a7.jpg",
    "viewer": "6,170",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p><strong>Miss và Remember đều có nghĩa là nhớ, nhưng đây lại là 2 từ hay gây nhầm lẫn cho người học (và cả Think Of và Think About nữa). Sau đây sẽ là vài điểm khác nhau giữa chúng:</strong></p><p>                                              <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/re.jpg?1476437025154\" style=\"height:159px; width:318px\"><br/><strong><u><span style=\"color:#B22222\">*Remember thì nó lại phân ra làm 2 cái</span>:</u></strong><br/><br/>\n-<strong>Remember To V: Nhớ để làm gì (Tức là việc đó chưa đc làm) = Recall, Consider</strong><br/><br/>\nEg: Remember to do your homework (Don't forget to do your homework) - <em>Nhớ làm bài về nhà nhá</em><br/>\nYou must consider doing your housework before I go home, OK? - <em>Mày phải nhớ làm việc nhà trước khi tao về nghe chưa?</em><br/><br/><strong>-Remember V-ing: Nhớ là đã làm gì (Các mem đừng nhầm đây là Hiện tại tiếp diễn nha)</strong><br/><br/>\nEg : Yesterday? Oh I remembered she was going to the club with some friends - <em>Ngày hôm qua ư? Tôi nhớ là cô ta đi tới câu lạc bộ cùng vài thằng bạn</em> <strong>(Vì đây là kể lại nên là remembered)</strong></img></p><p><span style=\"color:#B22222\"><strong>+) Miss cũng phân ra làm 2 cái (2 từ này tinh quái chưa)</strong></span><br/><br/><strong>- Miss Sb: Nhớ nhung ai đó (Tâm trạng)</strong><br/>\nEg: Since we say goodbye, I have been missing you so much honey -<em>Từ khi chúng ta chia tay anh nhớ em rất nhiều</em> (Vì anh vẫn còn nhớ từ khi chia tay nên là hiện tại hoàn thành tiếp diễn)</p><p>                                     <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/fffff.png?1476436936069\" style=\"height:175px; width:500px\"/></p><p><strong><span style=\"color:rgb(0, 0, 0); font-family:segoe ui,arial\">- </span><u><em>Miss St mang nghĩa là nhỡ cái gì đó (Chuyến tàu chẳng hạn)</em></u></strong><br/>\nEg: Hurry up or else we'll miss the last train - <em>Nhanh lên nếu không chúng ta sẽ lỡ chuyến tàu muộn nhất đấy</em><br/>\n- I must have breakfast so fast unless I'll miss the important meeting -<em> Tôi phải ăn sáng rất nhanh nếu không thì sẽ muộn buổi họp mặt quan trọng này mất</em><br/><br/><span style=\"color:#B22222\"><strong>Tóm lại: Remember thì đi với hành động, còn miss thì đi với người và vật</strong></span></p></div>",
    "page": 3
  },
  {
    "id": 43,
    "title": "Cách thành lập TÍNH TỪ GHÉP",
    "a_href": "https://tienganhtflat.com/blog/cach-thanh-lp-tinh-t-ghep",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/baitoan2-3759036515-a1a071f128e911c061b1e5a1f7682b35.png",
    "viewer": "6,058",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p><span style=\"color:#A52A2A\"><strong><u>Công thức 1</u>: Noun + Adjective</strong></span> (Danh từ + Tính từ )</p><p>1/ mile –wide: rộng một dặm.<br/>\n2/ lightning-fast: nhanh như chớp.<br/>\n3/ snow –white: trắng như tuyết<br/>\n4/ duty-free: miễn thuế hải quan<br/>\n5/ rock-hard: cứng như đá<br/>\n6/ home- sick: nhớ nhà<br/>\n7/ sea –sick: say sóng<br/>\n8/ air sick: say máy bay<br/>\n9/ water-proof: không thấm nước<br/>\n10/ air-tight: kín gió, kín hơi<br/>\n11/ praise-worthy: đáng khen<br/>\n12/ trust-worthy: đáng tin cậy.</p><p><span style=\"color:#B22222\"><strong><u>Công thức 2</u>: Number + Singular Count Noun</strong></span> ( Số + Danh từ đếm được số ít)</p><p>1/ a four-beedrom house: một căn nhà có bốn buồng ngủ<br/>\n2/ a eighteen-year –old girl: một cô gái mười tám tuổi</p><p><strong><span style=\"color:#B22222\"><u>Công thức 3:</u> Noun + Noun- ed</span></strong> (Danh từ + danh từ + ed)</p><p>                                          <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/Untitled-5.png?1477037595875\"/></p><p>1/ heart-shaped: hình trái tim<br/>\n2/ olive-skinned: có làn da màu olive, da nâu<br/>\n3/ lion-hearted: có trái tim sư tử, can đảm</p><p><span style=\"color:#B22222\"><strong><u>Công thức 4</u>: Adverb + past participle</strong></span> (Trạng từ + quá khứ phân từ )</p><p>1/ well-educated: được giáo dục tốt<br/>\n2/ well-dressed: ăn mặc đẹp<br/>\n3/ well-built: có vóc dáng to khoẻ, to con<br/>\n4/ newly-born: mới sinh</p><p><span style=\"color:#B22222\"><strong><u>Công thức 5</u>: Preposition + Noun</strong></span> (Giới từ +Danh từ)</p><p> oversears: ở hải ngoại</p></div>",
    "page": 3
  },
  {
    "id": 44,
    "title": "Phân biệt một số từ đồng nghĩa",
    "a_href": "https://tienganhtflat.com/blog/phan-bit-mt-s-t-ng-ngha",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/tu-dong-nghia-synonyms-2814-1446-3b19b8c23f-18770f97f844182c823fa20314bc59b1.jpg",
    "viewer": "4,054",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p>          <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/Untitled-4_1.png?1477037464926\"/></p><p><span style=\"color:#cc0066\"><strong>1. Start và Begin (bắt đầu, khởi đầu một sự vật- sự việc nào đó)</strong></span></p><p><u><em><strong>Start</strong></em></u>: được sử dụng cho các loại động cơ và xe cộ. Không dùng ‘’begin” trong những trường hợp này.</p><p>Ví dụ: It was a cold morning and I could not start my car.</p><p>(Sáng hôm đó trời lạnh quá nên tớ không sao nổ máy được)</p><p><u><em><strong>Begin</strong></em></u>: thường xuất hiện trong các tình huống trang trọng và trừu tượng hơn</p><p>Ví dụ: Before the universe began, time and place did not exist.</p><p>(Trước buổi sơ khai của vũ trụ, không gian và thời gian chưa hề tồn tại)</p><p><strong><span style=\"color:#cc0066\"> 2. End và Finish (kết thúc, chấm dứt việc gì đó)</span></strong></p><p><u><em><strong>End</strong></em></u>: với ý nghĩa quyết định ngừng/ chấm dứt cái gì đó</p><p>Ví dụ: They ended their relationship a year ago.</p><p>(Họ đã chấm dứt mối quan hệ cách đây một năm rồi).</p><p><u><em><strong>Finish</strong></em></u>: có thể mang ý nghĩa ‘hoàn thành’</p><p>Ví dụ: I haven’t finished my homework yet.</p><p>(Tớ vẫn chưa làm xong bài tập về nhà).</p><p><strong><span style=\"color:#cc0066\"> 3. Grow và Raise (tăng, làm tăng thêm cái gì đó)</span></strong></p><p><u><em><strong>Grow</strong></em></u>: thường xuất hiện với cây trồng, thực vật.</p><p>Ví dụ: In the south, the farmers grow crops.</p><p>(Nông dân miền Nam sống bằng nghề trồng cấy).</p><p><u><em><strong>Raise</strong></em></u>: thường đi với động vật và trẻ con</p><p>Ví dụ: In the north, the farmers mostly raise cattle.</p><p>(Ở miền Bắc, nông dân chủ yếu sống bằng nghề chăn nuôi gia súc).</p><p><span style=\"color:#cc0066\"><strong> 4. Clever, Smart và Intelligent: (thông minh- nhưng sắc thái khác nhau)</strong></span></p><p>                                               <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/smart.jpg?1476754292561\" style=\"height:265px; width:348px\"/></p><p><u><em><strong>Intelligent </strong></em></u>là từ mang đúng nghĩa thông minh nhất. Intelligent đồng nghĩa với brainy, dùng để chỉ người có trí tuệ, tư duy nhanh nhạy và có suy nghĩ lô-gíc hoặc để chỉ những sự vật, sự việc xuất sắc, là kết quả của quá trình suy nghĩ.</p><p>Ví dụ:Her answer showed her to be an intelligent young woman.</p><p>(Câu trả lời của cô ấy cho thấy cô ấy là một cô gái thông minh).</p><p><u><em><strong>Smart </strong></em></u>là một tính từ có rất nhiều nghĩa, trong đó cũng có ý nghĩa gần gống với intelligent. Tuy nhiên, intelligent chỉ khả năng phân tích, giải quyết vấn đề một cách khoa học và hiệu quả, còn smart lại chỉ sự nắm bắt nhanh nhạy tình hình hoặc diễn biến đang xảy ra.</p><p> Ví dụ: Smart lawyers can effectively manipulate juries.</p><p>(Những luật sư giỏi có thể tác động lên cả hội đồng xét xử).</p><p>Với nghĩa thông minh, smart còn được dùng với những vũ khí có khả năng tự định vị mục tiêu hoặc được điều khiển bằng máy tính như smart weapon, smart bomb. Ngoài ra, smart còn được dùng để chỉ diện mạo bên ngoài, thường là chỉ cách ăn mặc của một người. Trong trường hợp này, smart mang nghĩa là sáng sủa, gọn gàng, hay thời trang.</p><p> Ví dụ: You look very smart in that suit. (Cậu mặc bộ vest đó trông bảnh lắm!)</p><p><u><em><strong>Clever </strong></em></u>lại chỉ sự lanh lợi hoặc khôn ngoan.</p><p>Ví dụ: As a child, she was a clever girl. (Ngay từ bé, nó đã là một cô bé lanh lợi).</p><p>Tuy nhiên, clever thường được dùng với nghĩa lành nghề, khéo léo. Trong trường hợp này, clever đồng nghĩa với skillful.</p><p>Ví dụ: He is clever with his hands. (Anh ấy rất khéo tay).</p></div>",
    "page": 3
  },
  {
    "id": 45,
    "title": "CHỨC NĂNG CỦA ĐỘNG TỪ NGUYÊN THỂ",
    "a_href": "https://tienganhtflat.com/blog/chc-nng-ca-ng-t-nguyen-th",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/images-a4414f727d-eca53013960066ec6330af25f8ba979a.jpg",
    "viewer": "2,277",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p>     <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/Untitled-4.png?1477037342400\"/></p><p><span style=\"color:#800000\"><u><strong>I. Động từ nguyên mẫu có to được dùng làm:</strong></u></span></p><p><strong>1. Chủ ngữ của câu: </strong>        </p><p>Ví dụ: To become a famous singer is her dream.</p><p><strong>2. Bổ ngữ cho chủ ngữ:</strong>    </p><p>Ví dụ: What I like is to swim in the sea and then to lie on the warm sand.</p><p><strong>3.Tân ngữ của động từ  </strong>  </p><p>Ví dụ: It was late, so we decided to take a taxi home.</p><p><strong>4. Tân ngữ của tính từ    </strong>  </p><p>Ví dụ: I’m pleased to see you.</p><p><strong>5. Trong các cấu trúc:</strong></p><p>   + It takes / took + O + thời gian + to-inf                   </p><p>   + chỉ mục đích</p><p>   + bổ ngữ cho danh từ hoặc đại từ: S + V + Noun / pronoun + to-inf</p><p>           I have some letters to write.</p><p>           Is there anything to eat?</p><p>   + It + be + adj + to-inf: thật … để ..</p><p>Ví dụ: It is interesting to study English</p><p>   + S + be + adj + to-inf</p><p>Ví dụ: I’m happy to receive your latter.</p><p>   + S + V + too + adj / adv + to-inf</p><p>   + S + V + adj / adv + enough + to-inf</p><p>   + S + find / think / believe + it + adj + to-inf</p><p>Ví dụ: I find it difficult to learn English vocabulary.</p><p><strong>6. Sau các từ nghi vấn: what, who, which, when, where, how ,…</strong><strong> (nhưng thường không dùng sau why)</strong></p><p>Ví dụ: I don’t know what to say.</p><p><span style=\"color:#800000\"><u><strong>II. Động từ nguyên mẫu không \"to\" được dùng:</strong></u></span></p><p><strong>1. Sau động từ khiếm khuyết: can, will, shall, could, would,…</strong></p><p>Ví dụ: I could swim when i was 10</p><p><strong>2. Sau các động từ: let, make, would rather, had better</strong></p><p>Ví dụ: They made him repeat the whole story.</p><p><strong>3. Sau các động từ chỉ tri giác:</strong></p><p>hear, sound, smell, taste, feel, watch, notice, see, listen, find .. + O + V1</p><p>(chỉ sự hoàn tất của hành động – nghe hoặc thấy toàn bộ sự việc diễn ra)</p><p>Ví dụ: I saw her get off the bus.</p><p>- Help dùng cho cả \"to\" và không \"to\"</p><p>Help + to-inf / V1 / with Noun</p><p>Ví dụ: She usually helps her brother to do her homework.</p><p>      She usually helps her brother do her homework.</p><p>      She usually helps her brother with her homework.</p><p> </p></div>",
    "page": 3
  },
  {
    "id": 46,
    "title": "Cách sử dụng của \"either\" và \"neither\"",
    "a_href": "https://tienganhtflat.com/blog/cach-s-dung-cua-either-va-neither",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/7247943540a559f45d50b-675x400-be149da0bc-a1a071f128e911c061b1e5a1f7682b35.jpg",
    "viewer": "103,971",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p><span style=\"color:#B22222\"><strong>“Either” và “Neither” là 2 cụm từ có cách sử dụng giống như “so” và “too”, dùng để nói về “cũng”; tuy nhiên “Either” và “Neither” dùng để nói về “cũng” trong DẠNG PHỦ ĐỊNH.</strong></span></p><p>Ví dụ: </p><p>I didn't get enough to eat, and you didn't either. </p><p>I didn't get enough to eat, and neither did you.</p><p><em><u>Các bạn hãy chú ý </u></em></p><p>• Vị trí của từ “Either” và “Neither” trong câu. “Either” đứng ở cuối của câu, sau trợ động từ ở dạng phủ định, còn “Neither” đứng sau từ nối giữa 2 vế câu (thường là “and”), sau đó đến trợ động từ và động từ chính.</p><p>• Trong câu sử dụng “Neither” thì trợ động từ đứng sau “Neither” không được dùng ở dạng phủ định (không được dùng “not”), vì bản thân từ “Neither” đã mang nghĩa phủ định.</p><p><em>Khi chúng ta gặp 2 tình huống tương đồng, chúng ta vẫn có thể viết:</em></p><p>William doesn't work there, and John doesn't work there. </p><p><em>Nhưng trong thực tế, chúng ta nên sử dụng “Neither” hoặc “Either” cho câu trên như sau:</em></p><p>William doesn't work there, and John doesn't either. <br/>\nWilliam doesn't work there, and neither does John.</p><p><em>Chúng ta hãy cùng tham khảo một số ví dụ sử dụng “Neither” và “Either” thay thế được cho nhau:</em></p><p>Mary doesn't want to wake Tom up, and Christine doesn't either<br/>\nMary doesn't want to wake Tom up, and neither does Christine.</p><p>He's not very good at painting walls, and she isn't either.<br/>\nHe's not very good at painting walls, and neither is she.</p><p>She can't wait until the baby is born, and he can't either.<br/>\nShe can't wait unitl the baby is born, and neither can he.</p><p><em><strong>Tiếp theo, chúng ta sẽ được học cách sử dụng của 2 cụm từ “Either...or” và “Neither...nor”</strong></em></p><p><em><strong>                                <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/modulePARALLEL15.jpg?1477019404701\"/></strong></em></p><p><strong><span style=\"color:#B22222\">“EITHER...OR”</span></strong></p><p>“Either...or” được sử dụng để đưa ra sự lựa chọn giữa 2 khả năng. Các bạn có thể hiểu đơn giản là “Hoặc cái này... hoặc cái kia”</p><p>Ví dụ:</p><p>Either Mike or Lisa will be there.<br/>\n(Hoặc Mike hoặc Lisa sẽ ở đó)</p><p>Either you leave me alone or I will call the police.<br/>\n(Hoặc bạn để tôi yên hoặc tôi sẽ gọi cảnh sát)</p><p>We should bring either coffee or tea.<br/>\n(Chúng ta có thể mang theo cà phê hoặc trà)</p><p>You can either help us or go to your room.<br/>\n(Bạn có thể giúp chúng tôi hoặc đi vào phòng của bạn)</p><p>Ngoài ra, chúng ta còn bắt gặp “Either” trong cụm “Not...either...or”, để phủ định cả 2 khả năng trong câu.</p><p>Ví dụ:<br/>\nI don't think either Mike or Lisa will be there.<br/>\n(Tôi không nghĩ hoặc Mike hay Lisa sẽ ở đó)</p><p>He doesn't speak either English or French.<br/>\n(Anh ta không nói tiếng Anh cũng không nói tiếng Pháp)</p><p><strong><span style=\"color:#B22222\">“NEITHER ... NOR”</span></strong></p><p>Cụm “Neither...nor” tương đồng với “Not...either...or”</p><p>Ví dụ:</p><p>Neither Mike nor Lisa will be there.<br/>\n(Cả Mike và Lisa đều sẽ không ở đó)</p><p>He speaks neither English nor French.<br/>\n(Anh ta không nói tiếng Anh cũng như tiếng Pháp)</p><p>We brought neither coffee nor tea.<br/>\n(Chúng ta cũng không mang cà phê và cũng không mang trà)</p><p>I will neither help you nor go to my room.<br/>\n(Tôi sẽ không giúp bạn cũng không đi vào phòng tôi)</p><p>Ngoài ra, “Neither” cũng được sử dụng giống như “Not...either”</p><p>Ví dụ:</p><p>A: I don't speak French. (Tôi không nói tiếng Pháp)<br/>\nB: Neither do I.(Tôi cũng không). Trong thực tế, có thể trả lời “Neither do I” bằng cụm “Me neither”</p><p>C: He isn't ready to go.(Anh ta chưa sẵn sàng để đi)<br/>\nD: Neither are we.(Chúng ta cũng chưa sẵn sàng để đi)</p></div>",
    "page": 3
  },
  {
    "id": 47,
    "title": "Trợ động từ - Auxiliary verbs",
    "a_href": "https://tienganhtflat.com/blog/tr-ng-t-auxiliary-verbs",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/maxresdefault-07af41550a-688df2cb4ef0eac72f93add37ef1ff12.jpg",
    "viewer": "6,781",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p><u><strong>Có 12 trợ động từ trong tiếng Anh: be, have, do, can, shall, will, may, must, need, ought (to), dare, used (to).</strong></u></p><p>Trong số 12 trợ động từ nêu trên,<strong> có 9 động từ còn được xếp vào loại Động từ khuyết thiếu (Modal verbs)</strong>. Đó là các động từ can, may, must, will, shall, need, ought (to), dare và used (to).</p><p><span style=\"color:#800000\"><strong>I. Đặc tính chung của Trợ động từ (Auxiliary verbs)</strong></span></p><p>Trợ động từ (auxiliary verbs) có chung một số đặc tính sau đây:</p><p><strong>1. Hình thành thể phủ định bằng cách thêm NOT sau động từ.</strong></p><p>He is here - He is not here</p><p>They would help us - They would not help us</p><p> </p><p><strong>2. Hình thành thể nghi vấn bằng đảo ngữ (inversion).</strong></p><p>He is here - Is he here?</p><p> </p><p><strong>3. Hình thành Câu hỏi đuôi (Tag-question) bằng cách dùng lại chính động từ ấy.</strong></p><p>They were there, weren’t they?</p><p> </p><p><strong>4.  Hình thành Câu trả lời ngắn (short answer) bằng cách dùng lại chính động từ ấy.</strong></p><p>It will take hours to do this work.</p><p>Yes, it will. (No, it won’t)</p><p> </p><p><strong>5. Được dùng lại trong loại Câu tỉnh lược (elliptical sentences).</strong></p><p>They will spend their holidays in Spain. Will you? (= Will you spend your holiday in Spain?)</p><p> </p><p><span style=\"color:#800000\"><strong>II. Trợ động từ BE</strong></span></p><p><span style=\"color:#800000\"><strong>                    <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/79ffc5b580845e8aae1b607cbf68ea97.jpg?1477272313712\"/></strong></span></p><p><strong>1. BE được sử dụng làm trợ động từ để hình thành các thì tiếp diễn (Continuous Tenses) và thể thụ động (Passive Voice).</strong></p><p>She was washing clothes when we came.</p><p>He was washed to sign his name.</p><p> </p><p><strong>2. BE là một loại động từ chưa đầy đủ (incomplete predication). Vì thế luôn đòi hỏi phải có một bổ ngữ từ (Complement) để hoàn thành ý nghĩa của câu.</strong></p><p>Your dinner is ready.</p><p>His father was a famous man.</p><p> </p><p><strong>3. Khi được sử dụng như một động từ hoàn chỉnh, BE có nghĩa là \"hiện hữu, tồn tại\".</strong></p><p>I think, therefore I am.</p><p> </p><p><strong>4. BE TO diễn tả:</strong></p><p><em>a) Một sự thu xếp, sắp đặt (arrangement).</em></p><p>The wedding is to take place on Saturday.</p><p><em>b) Một mệnh lệnh, một yêu cầu.</em></p><p>You are to see the headmaster at 4 o’clock.</p><p><em>c) Tính chất tương lai trong những trường hợp cần diễn tả tương lai trong quá khứ (Future in the Past).</em></p><p>My sister and her husband were to come and see us this weekend, but they couldn’t come.</p><p> </p><p><strong>5. DO BE là một hình thức nhấn mạnh, làm tăng ý nghĩa tình cảm của hành động hay làm cho câu nó có ý nghĩa thuyết phục hơn.</strong></p><p>Do be careful when you cross the road.</p><p>Do be as nice to him as you can.</p><p> </p><p><strong>6.  Một số thành ngữ với BE</strong></p><p>- be able to: có thể, có khả năng</p><p>I am not able to guarantee the results.</p><p> </p><p>-be about to: sắp sửa</p><p>The plane is about to take off.</p><p> </p><p>- be apt to: có khiếu, nhanh trí về</p><p>He’s apt to ask awkward questions.</p><p> </p><p>- be bound to: nhất định, có khuynh hướng</p><p>Prices are bound to go up this autumn.</p><p> </p><p>- be certain to: chắc chắn</p><p>The match is certain to start on time.</p><p> </p><p>- be due to: vì, do bởi, ắt hẳn, nhất định</p><p>He’s due to arrive at any moment.</p><p> </p><p>- be going to: định sẽ</p><p>We’re going to need more staff here.</p><p> </p><p>- be liable to: có khả năng sẽ</p><p>This machine is liable to break down.</p><p> </p><p>- be sure to: chắn chắn, dứt khoát là</p><p>He’s sure to be waiting outside.</p><p> </p><p>- be likely to: có vẻ như là</p><p>They’re likely to win by several goals.</p><p> </p><p>- be meant to: ý muốn nói là</p><p>Are you meant to work overtime?</p><p> </p><p>- be supposed to: xem là, có nhiệm vụ là</p><p>We’re not supposed to smoke in here.</p><p> </p><p><span style=\"color:#800000\"><strong>III. Trợ động từ HAVE</strong></span></p><p><strong>1.  HAVE được dùng làm trợ động từ để tạo các thì hoàn thành (Perfect Tenses).</strong></p><p>I have answered your questions.</p><p>Has he finished his dinner?</p><p> </p><p><strong>2.  Khi được dùng như một động từ chính trong câu, HAVE có nghĩa là sở hữu (possess). Với ý nghĩa này, trong văn nói và trong nhiều cấu trúc văn viết, got được thêm vào với have mà không làm tăng thêm ý nghĩa.</strong></p><p>The man has (got) a car.</p><p>How many children have you (got)?</p><p> </p><p><strong>3.  Khi dùng với nghĩa khác hơn là sở hữu, HAVE có các hình thức phủ định, nghi vấn... như các động từ thông thường khác. Khi ấy HAVE cũng không dùng với got ở phía sau.</strong></p><p>Did you have a letter from home? (= receive)</p><p>I don’t have much difficulty with English grammar (= find, experience)</p><p>    <em>Với cách sử dụng này HAVE thường diễn tả một hành động có tính chất của một thói quen, một sự lặp đi lặp lại nhiều lần. Hãy so sánh hai câu sau:</em></p><p>He has a walk in the garden. (Ông ta đi dạo trong vườn)</p><p>He walks in the garden. (Ông ta bước đi trong vườn)</p><p> </p><p><strong>4. HAVE có thể được dùng trong thể nguyên nhân (Causative). Cách sử dụng này cho biết ai đã gây nên một hành động nào. Causative của HAVE có hai cấu trúc sau:</strong></p><p>active:  S + (have) + O1 + V + O2</p><p>passive:            S + (have) + O2 + past participle (by O1)</p><p> </p><p>They had Daisy clean the floor. (Họ bảo Daisy lau nhà)</p><p>We have just had our house painted. (Chúng tôi vừa cho người sơn căn nhà của chúng tôi)</p><p>Why don’t you have your hair cut? (Tại sao anh không đi hớt tóc)</p><p> </p><p>            Trong hầu hết các trường hợp này HAVE có thể được thay thế bởi GET.</p><p>Why don’t you get your hair cut?</p><p>They got the floor cleaned.</p><p> </p><p><strong>5.  HAVE TO (phải, cần phải) dùng diển tả một sự cần thiết (necessity), sự cưỡng bách, bắt buộc (compulsion). Trường hợp này HAVE cũng có thể dùng với got ở phía sau.</strong></p><p>I missed the bus, so I had to walk to the office.</p><p>You’ve got to work hard to make a living.</p><p> </p><p><strong>6. HAVE TO được dùng thay cho MUST ở các thì mà MUST không có</strong>.</p><p>You will have to leave for work early in the morning.</p><p>We had to answer all the questions in the examination.</p><p> </p><p><span style=\"color:#800000\"><strong>IV. Trợ động từ DO</strong></span></p><p><span style=\"color:#800000\"><strong>             <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/what-can-i-do.jpg?1477272517911\"/></strong></span></p><p>DO có thể là</p><p>- một động từ thường:</p><p>He does his work well.</p><p> </p><p>- một trợ động từ. Khi dùng làm trợ động từ, DO có những cách sử dụng sau đây:</p><p> </p><p><em>1. Dùng để hình thành thể phủ định (negative) và thể nghi vấn (interrogative) cho các động từ thường.</em></p><p>What does he read?</p><p>She doesn’t like swimming.</p><p>Don’t sit on that chair!</p><p> </p><p><em>2. Dùng để hình thành Câu hỏi đuôi (Tag-questions) khi động từ trong câu chính là một động từ thường.</em></p><p>They stayed in that hotel, didn’t they?</p><p>Mary doesn't clean the floor, does she?</p><p> </p><p><em>3. Dùng để tránh lập lại động từ chính khi động từ chính là một loại động từ thường trong câu trả lời ngắn (short answer).</em></p><p>David likes swimming. - So do I.</p><p>Did they go to London? - Yes, they did.</p><p>Mary doesn’t like fish, neither does Fred.</p><p> </p><p><em>4. Dùng để hình thành Thể Nhấn mạnh (Emphatic Form).</em></p><p>You did make me surprised.</p><p>He does write his name on the board.</p></div>",
    "page": 3
  },
  {
    "id": 48,
    "title": "10 trường hợp dùng that không dùng which",
    "a_href": "https://tienganhtflat.com/blog/10-trng-hp-dung-that-khong-dung-which",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/grossgrammarthatvswhich-b0020c7bbb-7b370017d05fc0efb28e67c0e587340b.png",
    "viewer": "15,678",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p><strong><span style=\"color:#A52A2A\">1. Phía trước là “all, little, much, few, everything, none ” thì dùng “that” mà không dùng “which”</span>.</strong><br/>\nEx: There are few books that you can read in this book store.<br/>\n(Có một vài cuốn sách mà bạn có thể đọc ở tiệm sách này).</p><p>  <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/52555.png?1477376775919\"><br/><span style=\"color:#800000\"><strong>2. Từ được thay thế phía trước vừa có người vừa có vật thì dùng “that” mà không dùng “which”.</strong></span><br/>\nEx: He asked about the factories and workers that he had visited.<br/>\n(Ông ấy hỏi về những công ty và công nhân mà ông ấy đã đến thăm)<br/><br/><strong><span style=\"color:#800000\">3. Từ được thay thế phía trước có định ngữ là tính từ ở cấp so sánh hơn nhất thì dùng “that” mà không dùng “which”.</span></strong><br/>\nEx: This is the best novel that I have ever read.<br/>\n(Đây là cuốn tiểu thuyết hay nhất mà tôi từng đọc).<br/><br/><span style=\"color:#800000\"><strong>4. Từ được thay thế phía trước có định ngữ là số thứ tự thì dùng “that” mà không dùng “which”.</strong></span><br/>\nEx: The first sight that was caught at the Great Wall has made a lasting impression on him.<br/>\n(Cảnh tượng đầu tiên về Vạn lý trường thành đập vào mắt ông ấy gây được ấn tượng khó quên với ông).<br/><br/><span style=\"color:#800000\"><strong>5. Từ được thay thế phía trước có định ngữ là “the only, the very, the same, the right” thì dùng “that” mà không dùng “which”.</strong></span><br/>\nEx: It is the only book that he bought himself.<br/>\n(Đó là cuốn sách duy nhất mà anh ta đã tự mình mua).<br/><br/><strong><span style=\"color:#800000\">6.Từ được thay thế phía trước có định ngữ là “all, every, any, much, little, few, no” thì dùng “that” mà không dùng “which”.</span></strong><br/>\nEx: You can take any room that you like.<br/>\n(Anh có thể lấy bất cứ phòng nào mà anh thích).<br/>\n- There is no clothes that fit you here.<br/>\n(Ở đây chẳng có bộ quần áo nào phù hợp với bạn cả).<br/><br/><span style=\"color:#800000\"><strong>7. Trong câu hỏi (Mệnh đề chính) mở đầu bằng “which” thì dùng “that” mà không dùng “which” làm từ nối.</strong></span><br/>\nEx: Which of the books that had pictures was worth reading?<br/>\n(Những cuốn sách có tranh ảnh thì đáng đọc đúng không?)<br/><br/><strong><span style=\"color:#800000\">8. Trong câu nhấn mạnh “It is … that …” thì dùng “that” mà không dùng “which” làm từ nối .</span></strong><br/>\nEx: It is in this room that he was born twenty years ago.<br/>\n(Cách đây hai mươi năm chính trong căn phòng này ông ấy đã được sinh ra).<br/><br/><span style=\"color:#800000\"><strong>9. Trong câu dùng cấu trúc “such (the same) … as …” dùng từ nối “as” không dùng “which”.</strong></span><br/>\nEx: We need such materials as can bear high temperature.<br/>\n(Chúng tôi cần những vật liệu có thể chịu được nhiệt độ cao như thế này).<br/><br/><strong><span style=\"color:#800000\">10. Diễn tả ý “giống như…..”dùng từ nối “as” không dùng “which”.</span></strong><br/>\nEx: Mary was late again, as had been expected</img></p></div>",
    "page": 3
  },
  {
    "id": 49,
    "title": "Cách sử dụng thú vị của từ MAKE trong tiếng Anh",
    "a_href": "https://tienganhtflat.com/blog/cach-s-dng-thu-v-ca-t-make-trong-ting-anh",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/marguerite-7295101280-675x400-b5b7e7088f-9c09d04182c6b4e0f2760460ecdda22f.jpg",
    "viewer": "8,041",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/5555.png?1477532372306\"/></p><p><strong>1. Nếu bạn thi trượt, bạn bè của bạn an ủi \" Make light of it\", thì \"make a light of it\" ở đây nghĩa là gì?</strong></p><p>Make light of = treat as unimportant (xem như là không quan trọng). Ngược với nó là Make much of=treat as very important.</p><p><strong>2. Don’t make fun of somebody (make fun of= chế nhạo) - đừng có mà lôi ai đó ra làm trò cười!</strong></p><p><strong>3. Make sense (hợp lý, có thể hiểu được):</strong></p><p>It doesn’t make any sense - Chẳng hợp lý gì cả, chẳng hiểu gì cả.</p><p><strong>4. Make up someone’s mind là quyết định.</strong></p><p>Make up trong các trường hợp khác còn có các nghĩa khác nữa:</p><p>Make up a story: Dựng nên một câu chuyện</p><p>She’s making up for a big show: Cô ấy đang trang điểm cho một buổi biểu diễn lớn.</p><p>Let me make it up to you: Để tôi đền cho bạn nhé.</p><p>You should make up with her: Hãy làm lành với cô ấy đi.</p><p><strong>5. Nếu tra từ điển thì Make có rất nhiều nghĩa tương ứng với các cách dùng khác nhau nhưng có một số cách dùng hay và thường gặp trong thực tế, ví dụ như make believe ≈ pretend đã gặp trong bài hát nổi tiếng Thank you for loving me:</strong></p><p>“If I tried, you'd make believe - Nếu như anh thử (nói dối), em sẽ vờ như</p><p>That you believed my lies - Rằng em tin những lời nói dối của anh”</p><p><strong>6. Vậy make my peace with có nghĩa là gì? Make someone’s peace with có nghĩa là cam chịu với cái gì đó.</strong></p><p><strong>7.  Make someone’s day.</strong></p><p>Thank you very much for your gift. It really made my day!</p><p>Rất cám ơn bạn về món quà. Nó làm tôi thực sự hạnh phúc!</p><p><strong>8. Make ends meet (= make both ends meet) có nghĩa là xoay sở đủ sống, tức là những gì bạn làm ra thì đủ trang trải cho cuộc sống của bạn mà không thiếu thốn hay phải mắc nợ</strong>.</p><p><strong>9. - The appointment was at 6 p.m but she couldn’t make it there in time because of the traffic jam.</strong></p><p>- After 10 years of striving, finally he made it as the most successful talent agent in town.</p><p>Make it trong 2 trường hợp này có nghĩa là thành công hay đạt được một cái gì hay một việc gì đó.</p><p>Trường hợp 1, cô ấy đã không thành công trong việc đến điểm hẹn: Có hẹn lúc 6 giờ tối nhưng cô ấy đã không thể đến đó kịp giờ vì kẹt xe quá.</p><p>Trường hợp 2, anh ấy đã thành công trong việc phấn đấu lập nghiệp của mình: Sau 10 năm nỗ lực phấn đấu, cuối cùng anh ấy đã trở thành người đại diện cho các nghệ sĩ thành công nhất trong thành phố.</p><p><strong>10. Các bạn hãy cố gắng make the most of (tận dụng hết, sử dụng tối đa) what you’ve learnt today và cùng chia sẻ những cách sử dụng hay của các động từ ghép, các thành ngữ với make nhé!</strong></p></div>",
    "page": 3
  },
  {
    "id": 50,
    "title": "Các cấu trúc câu so sánh",
    "a_href": "https://tienganhtflat.com/blog/cac-cu-truc-cau-so-sanh",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/444-4397976fa9-7b370017d05fc0efb28e67c0e587340b.jpg",
    "viewer": "37,297",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p>         <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/1319329242_adj.jpg?1477621002512\" style=\"line-height:1.6\"/></p><p><span style=\"color:#800000\"><strong>1. So sánh bằng</strong></span></p><p><em><strong>So sánh bằng chỉ ra 2 thực thể chính xác giống nhau (bằng nhau hoặc như nhau) và ngược lại nếu cấu trúc so sánh ở dạng phủ định.</strong></em></p><p><u>Cấu trúc:</u></p><div style=\"background: rgb(238, 238, 238) none repeat scroll 0% 0%; border: 1px solid rgb(204, 204, 204); padding: 5px 10px; text-align: center;\"><span style=\"font-size:16px\"><strong>S + verb + as + adj/ adv + as noun/ pronoun/ S + V</strong></span></div><p><strong>– Nếu là cấu trúc phủ định “as” thứ nhất có thể thay bằng “so“.</strong></p><p><strong><em>Ví dụ:</em></strong></p><p>   She is not so tall as her sister. (Cô ấy không cao bằng chị cô ấy)</p><p><u>Lưu ý</u>: Ta cần phải nhớ rằng đại từ sau “as” luôn ở dạng đại từ tân ngữ.</p><p><strong><em>Ví dụ:</em></strong></p><p>     1/ John is as thin as me. (John gầy như tôi)</p><p>     2/ Peter are as young as his friend. (Peter trẻ như bạn cậu ý)</p><p>* Một số thí dụ về so sánh bằng:</p><p>   1/ My book is as thick as yours. (Quyển sách của tôi dày bằng quyển sách của bạn)</p><p>   2/ He plays tennis as well as Peter. (Anh ấy chơi tennis giỏi như Peter)</p><p><strong>– Danh từ cũng có thể  dùng để so sánh cho cấu trúc này nhưng trước khi so sánh phải xác định chắc chắn rằng danh từ đó có những tính từ tương đương như  sau:</strong></p><table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td style=\"text-align:center\">Tính từ</td><td style=\"text-align:center\">        Danh từ</td></tr><tr><td style=\"text-align:center\">heavy, light\n<p>wide, narrow</p><p>deep, shallow</p><p>long, short</p><p>big, small</p></td><td style=\"text-align:center\">       weight\n<p>      width</p><p>       depth</p><p>        length</p><p>      size</p></td></tr></tbody></table><p>-&gt; Cấu trúc dùng cho loại này sẽ là “the same … as“.</p><div style=\"background: rgb(238, 238, 238) none repeat scroll 0% 0%; border: 1px solid rgb(204, 204, 204); padding: 5px 10px; text-align: center;\"><strong>Subject + verb + the same + (noun) + as noun/ pronoun</strong></div><p>Ví dụ:</p><p>1/ Her hair is as long as Mary’s hair (Tóc cô ấy dài như tóc Mary)</p><p>2/ Her hair is the same height as Mary’s hair. (Tóc của cô ấy có chiều dài bằng tóc của Mary)</p><p><u>Lưu ý:</u></p><p>– The same as trái nghĩa với different from : My nationality is different from hers.</p><p>– Trong tiếng Anh của người Mỹ có thể dùng “different than” nếu sau đó là cả một câu hoàn chỉnh (không phổ biến).</p><p>Ví dụ:</p><p>   His plan is different from what I have thought.</p><p>= His plan is different than I have thought.</p><p>(Kế hoạch của anh ý khác với những gì tôi đã nghĩ)</p><p>– “From” có thể thay thế bằng to.</p><p>Một số thí dụ về “the same” và “different from”:</p><p>1/ These tables are the same as those. (Nhưng chiếc bàn này cũng giống những chiếc bàn kia)</p><p>2/ He sings the same song as her. (Anh ý hát một bài hát giống với cô ấy)</p><p>3/ Their plan is different from ours. (Kế hoạch của họ khác với kế hoạch của bọn tôi)</p><p><span style=\"color:#800000\"><strong>2. So sánh hơn, kém</strong></span></p><p><span style=\"color:#800000\"><strong>                            <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/comp-strawberries.jpg?1477621522196\"/></strong></span></p><p>– Trong loại so sánh này, người ta phân ra làm 2 loại phó từ, tính từ ngắn và phó từ, tính từ dài.</p><p>– Đối với các phó từ và tính từ ngắn, ta chỉ cần cộng thêm đuôi ER vào tận cùng.</p><p>– Đối với những tính từ ngắn có 1 nguyên âm kẹp giữa 2 phụ âm, ta phải gấp đôi phụ âm cuối để không phải thay đổi cách đọc.</p><p><u>Lưu ý:</u></p><p>– Tính từ ngắn là những tính từ  chỉ có một âm tiết, ví dụ: nice, great, cool, hot, short, poor, warm, clean, …</p><p>– Tính từ dài là những tính từ có từ  hai ấm tiết trở lên, ví dụ: tired, sleepy, nervous, crowded, anxious, wonderful, exquisite, exorbitant,…</p><p>Ví dụ:</p><p>strong – stronger.</p><p>tall – taller</p><p>hot – hotter</p><p>– Những tính từ có tận cùng bằng bán nguyên âm phải đổi thành ier (y – ier)</p><p>Ví dụ:</p><p>happy – happier</p><p>friendly – friendlier (hoặc more friendly than)</p><p>– Trường hợp ngoại lệ: strong – stronger.</p><p>– Đối với tất cả các phó từ và tính từ dài dùng MORE (nếu hơn) và dùng LESS ( nếu kém).</p><p>Ví dụ: more wonderful, more beautiful, more comfortable.</p><table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td>S+V </td><td><p>adj/adv(ngắn)+er</p><p>more+adj/adv(dài)</p><p>less+adj(dài)</p></td><td>than</td><td>noun/pronoun/S +V</td></tr></tbody></table><p><strong> </strong><span style=\"color:#000000\"><em>Ví dụ:</em></span></p><p>1/ John’s salary are higher than his sister’s. (Lương của John cao hơn lương của chị anh ý)</p><p>2/ Today is colder than yesterday. (Ngày hôm nay lạnh hơn ngày hôm qua)</p><p>3/ This task is more important than the other. (Nhiệm vụ này quan trọng hơn những nhiệm vụ còn lại)</p><p>4/ He speaks English more fluently than I do . (Anh ý nói tiếng anh trôi chảy hơn tôi)</p><p>5/ He goes to school less frequently than she does. (Anh ý đi học không đều đặn bằng cô ấy)</p><p>6/ His speech in this year is less impressive than last year’s. (Bài diễn thuyết năm nay của anh ta không ấn tượng bằng năm ngoái)</p><p> </p><p>– Để nhấn mạnh cho tính từ và phó từ so sánh người ta dùng “far” hoặc “much“trước so sánh.</p><div style=\"background: rgb(238, 238, 238) none repeat scroll 0% 0%; border: 1px solid rgb(204, 204, 204); padding: 5px 10px; text-align: center;\"><strong>Subject + verb + far / much + Adv / Adj (ngắn) +er + than Noun / pronoun</strong></div><p style=\"text-align:center\"> </p><div style=\"background: rgb(238, 238, 238) none repeat scroll 0% 0%; border: 1px solid rgb(204, 204, 204); padding: 5px 10px; text-align: center;\"><strong>Subject + verb + far/ much More/ less Adj/ Adv(dài) + than Noun/ pronoun</strong></div><p><em>– Một số thành ngữ nhấn mạnh : much, too much</em></p><p>Ví dụ:</p><p>1/ His car is far more expensive than mine. (xe ô tô của anh ý đắt hơn xe của tôi rất nhiều)</p><p>That meals we ate last night in restaurant was much less delicious than the one we cook by ourselves. (Bữa ăn chúng tôi ăn tối qua tại nhà hàng không ngon bằng bữa ăn chúng tôi tự nấu)</p><p>2/ Lemon is much sourer than orange. (Chanh chua hơn cam rất nhiều)</p><p>3/ She talks much more fluently than her friend. (Cô ta nói trôi chảy hơn bạn cô ấy)</p><p>4/ He speaks Japanese much more rapidly than he does English. (Anh ta nói tiếng Nhật nhanh hơn anh ta nói tiếng Anh)</p><p>5/ His watch is far better than yours. (Cái đồng hồ của anh ta tốt hơn nhiều cái của bạn)</p><p><em>– Danh từ cũng có thể được dùng để so sánh trong các cấu trúc bằng hoặc hơn, kém.</em></p><p><em>– Trong cấu trúc so sánh bằng chỉ cần xác định xem danh từ đó là đếm được hay không đếm được vì trước chúng có một số định ngữ dùng với 2 loại danh từ đó.</em></p><p><em>– Trong cấu trúc so sánh hơn kém cũng cần phải xác định xem danh từ đó là đếm được hay không đếm được vì đằng trước chúng có dùng fewer (cho đếm được),  less(không đếm được) và more dùng chung cho cả 2 (công thức dưới đây). Do cấu trúc này không phức tạp nên được dùng rộng rãi hơn so với cấu trúc so sánh bằng.</em></p><div style=\"background: rgb(238, 238, 238) none repeat scroll 0% 0%; border: 1px solid rgb(204, 204, 204); padding: 5px 10px; text-align: center;\"><strong>S + V + as + many/ much/ little/ few + noun + as + noun/ pronoun</strong></div><p style=\"text-align:center\"><strong>Hoặc</strong></p><div style=\"background: rgb(238, 238, 238) none repeat scroll 0% 0%; border: 1px solid rgb(204, 204, 204); padding: 5px 10px; text-align: center;\"><strong>Subject + verb + more/ fewer/ less + noun + than + noun/ pronoun</strong></div><p>Ví dụ:</p><p>1/ I have more friend than she does. (Tôi có nhiều bạn hơn cô ấy)</p><p>2/ I have fewer book than her. (Tôi có ít sách hơn cô ấy)</p><p>3/ She earns as much money as her husband. (Anh ta kiếm được nhiều tiền hơn chồng của cô ấy)</p><p>4/ They have as few chances as us. (Họ có ít cơ hội như chúng tôi)</p><p><span style=\"color:#800000\"><strong>3. Các dạng so sánh đặc biệt</strong></span></p><p>Bảng dưới đây là một số dạng so sánh đặc biệt của tính từ và phó từ. Trong đó lưu ý rằng “farther” dùng cho khoảng cách, “further” dùng cho thông tin và những vấn đề trừu tượng khác.</p><p>Tính từ và phó từ So sánh hơn kém So sánh nhất</p><table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td>Tính từ và phó từ</td><td>       So sánh hơn kém</td><td>  So sánh nhất</td></tr><tr><td style=\"text-align:center\">far</td><td style=\"text-align:center\">farther</td><td style=\"text-align:center\">the farthest</td></tr><tr><td style=\"text-align:center\">little</td><td style=\"text-align:center\">further</td><td style=\"text-align:center\">the furthest</td></tr><tr><td style=\"text-align:center\">muchmany</td><td style=\"text-align:center\">less</td><td style=\"text-align:center\">the least</td></tr><tr><td style=\"text-align:center\">goodwell</td><td style=\"text-align:center\">more</td><td style=\"text-align:center\">the most</td></tr><tr><td style=\"text-align:center\">badbadly</td><td style=\"text-align:center\">better</td><td style=\"text-align:center\">the best</td></tr><tr><td> </td><td style=\"text-align:center\">worse</td><td style=\"text-align:center\">the worst</td></tr></tbody></table><p>Ví dụ:</p><p>1/ I feel much worse today than I did yesterday. (Tôi cảm thấy hôm nay tệ hơn hôm qua rất nhiều)</p><p>2/ The university is farther than the mall. (Trường đại học thì xa trung tâm thương mại hơn)</p><p>3/ He has less money now than he had before. (Bây giờ anh ta ít tiền hơn trước đây)</p><p><strong><em><u>Lưu ý:</u> further = more.</em></strong></p><p>Ví dụ:</p><p>1/ The distance from your house to school is farther than the distance from your house to mall. (Quãng đường từ nhà bạn tời trường xa hơn khoảng các từ nhà bạn tới trung tâm thương mại)</p><p>2/ We will need a meeting for further information of this project. (Chúng ta sẽ cần thêm một buổi nói chuyện để có thêm thông tin về dự án)</p><p><span style=\"color:#800000\"><strong>4. So sánh bội số</strong></span></p><p>Là loại so sánh gấp rưỡi, gấp đôi, gấp 3. Nên nhớ rằng trong cấu trúc này không được dùng so sánh hơn kém mà phải dùng so sánh bằng.</p><table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td dir=\"rtl\" style=\"text-align:left\"><strong>S+v+bội số+as</strong></td><td><p><strong>much</strong></p><p><strong>noun </strong></p><p><strong>many</strong></p></td><td><p style=\"text-align:center\"><strong>as +</strong></p><p style=\"text-align:center\"><strong>N/pronoun</strong></p></td></tr></tbody></table><h3 style=\"color:#aaa; font-style:italic\"> </h3><p>Ví dụ:</p><p>1/ This house costs twice as much as the other one. (Ngôi nhà này đắt gấp đôi nhưng ngôi nhà khác)</p><p>2/ Our company have three times as much information of project as their. (Công ty của chúng tôi có số thông tin về dự án nhiều gấp 3 lần họ)</p><p>3/ I has half as much money now as I had last year. (Tôi chỉ có số tiền bằng một nửa số tôi có năm ngoái)</p><p><u>Lưu ý:</u></p><p>– Khi dùng so sánh loại này phải xác định rõ danh từ đó là đếm được hay không đếm được vì đằng trước chúng có “much” và “many”.</p><p>– Các cấu trúc:     <strong>twice that  much/ many</strong> (gấp đôi số đó) chỉ được dùng trong văn nói, tuyệt đối không được dùng trong văn viết.</p><p>Ví dụ:</p><p>We had expected eighty people at the meeting, but twice that many showed up. (văn nói)</p><p>We had expected eighty people at the meeting, but twice as many as that number showed up. (văn viết)</p><p>(Chúng tôi chỉ hi vọng 80 người có mặt tại biểu gặp mặt nhưng số lượng người có mặt là gấp đôi)</p><p><span style=\"color:#800000\"><strong>5. So sánh kép (càng ….thì càng)</strong></span></p><p>Những câu này bắt đầu bằng một cấu trúc so sánh hơn, và do đó mệnh đề thứ 2 cũng phải bắt đầu bằng một cấu trúc so sánh hơn.</p><div style=\"background: rgb(238, 238, 238) none repeat scroll 0% 0%; border: 1px solid rgb(204, 204, 204); padding: 5px 10px; text-align: center;\"><strong>The + comparative + subject + verb + the comparative + subject + verb</strong></div><p>Ví dụ:</p><p>1/ The harder you study, the better your result will be (Bạn càng học hành chăm chỉ thì kết quả càng tốt)</p><p>                    <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/toi-tai-gioi-ban-cung-the-chuong-16-tao-quyet-tam-manh-me-tuc-thi-2919.jpg?1477621892713\"/></p><p>2/ The sooner you wake up, the earlier you go to school (Bạn dậy càng sớm bạn càng đến trường sớm)</p><p>3/ The earlier you leave, the earlier you’ll be back (Bạn càng đi sớm bạn càng về sớm)</p><div style=\"border: 1px solid rgb(204, 204, 204); padding: 5px 10px; text-align: center; background: rgb(238, 238, 238);\"><strong>The more + subject +verb + the + comparative + subject + verb</strong></div><p>4/ The more he eats , the fatter he is. (Anh ta ăn càng nhiều thì anh ta càng béo)</p><p>5/ The more I look into your eyes, the more I love you. (Càng nhìn vào mắt bạn tôi càng thấy yêu bạn)</p><p>6/ The bigger they are, the faster they fall. (Chúng càng to bao nhiêu thì càng rơi nhanh bấy nhiêu)</p><p><span style=\"color:#800000\"><strong>6. So Sánh Hơn Nhất.</strong></span></p><table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td>S+v+the+most </td><td><p>Adj(ngắn)+est</p><p>adj(dài)</p><p>least + adj</p></td><td>Noun</td></tr></tbody></table><p>               </p><p>– Ở cấp độ so sánh hơn nhất, 3 thực thể trở lên được so sánh với nhau, một trong chúng trội hơn  hoặc kém hơn so với các thực thể còn lại.</p><p>1/ Winter is the coldest season in year. (Mùa đông là mùa lạnh nhất trong năm)</p><p>2/ John is the tallest of the three brothers. (John là người cao nhất trong 3 anh em.)</p><p>3/ These shoes are the most expensive of all. (Những chiếc giày đó là đắt nhất trong tất cả)</p><p>4/ She is the most beautiful I have ever met (Cô ấy là cô gái đẹp nhất tôi từng gặp)</p><p><u>Lưu ý:</u></p><p>– Sau thành ngữ “one of the + superlative“, danh từ phải để ở dạng số nhiều và động từ chia ở ngôi số ít.</p><p>Ví dụ:</p><p>1/ One of the greatest football players in the world is Messi. (Một trong những cầu thủ bóng đá tuyệt vời nhất trên thế giới là Messi)</p><p>2/ China is one of the largest countries in the world. (Trung Quốc là một trong những quốc gia có diện tích lớn nhất thế giới)</p><p>– Các phó từ  không được đi kèm bởi “-er“ hoặc “-est“. Mà thay vì đó, khi được dùng trong câu so sánh chúng đi cùng “more” hoặc “less“ đối với cấp so sánh hơn, và với“most“ hoặc “least“ để thành lập nên dạng so sánh hơn nhất.</p><table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td><strong>Dạng nguyên</strong></td><td><strong>So sánh hơn</strong></td><td><strong>So sánh hơn nhất</strong></td></tr><tr><td> </td><td>more carefully</td><td>the most carefully</td></tr><tr><td>carefully</td><td>less carefully</td><td>the least carefully</td></tr><tr><td>cautiously</td><td>more cautiously</td><td>the most cautiously</td></tr><tr><td> </td><td>less cautiously</td><td>the least cautiously</td></tr></tbody></table><p> </p><p>Ví dụ:</p><p> </p><p>1/ I drove more carefully than my sister. (Tôi lái xe cẩn thận hơn chị tôi)</p><p>2/ Peter dances more skillfully than his partner. (Peter nhảy điêu luyện hơn đối tác của anh ta)</p></div>",
    "page": 3
  },
  {
    "id": 51,
    "title": "Dấu hiệu nhận biết loại từ trong câu tiếng Anh",
    "a_href": "https://tienganhtflat.com/blog/du-hiu-nhn-bit-loi-t-trong-cau-ting-anh",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/723294167664750795261647442178n-9776ee2fa7-120410d3fdd712f335f1e44b992e99f0.jpg",
    "viewer": "17,248",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p>               <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/djhgfj.png?1477879256677\"/></p><p><span style=\"font-size:14px\"><strong><span style=\"color:rgb(0, 102, 0)\">CÁCH NHẬN BIẾT TỪ LOẠI DỰA VÀO VỊ TRÍ CỦA TỪ</span></strong></span></p><p><span style=\"color:#800000\"><strong>I. <u>Danh từ (nouns):</u></strong></span></p><p>Danh thường được đặt ở những vị trí sau</p><p><strong><em>1. Chủ ngữ của câu (thường đứng đầu câu,sau trạng ngữ chỉ thời gian)</em></strong></p><p>Ex: Maths is the subject I like best.</p><p>Yesterday Lan went home at midnight.</p><p><strong><em>2. Sau tính từ: my, your, our, their, his, her, its, good, beautiful….</em></strong></p><p>Ex: She is a good teacher.</p><p>His father works in hospital.</p><p><strong><em>3. Làm tân ngữ, sau động từ</em></strong></p><p>Ex: I like English.</p><p>We are students.</p><p><strong><em>4. Sau “enough”</em></strong></p><p>Ex: He didn’t have enough money to buy that car.</p><p><strong><em>5. Sau các mạo từ a, an, the hoặc các từ this, that, these, those, each, every, both, no, some, any, few, a few, little, a little,…..(Lưu ý cấu trúc a/an/the + adj + noun)</em></strong></p><p>Ex: This book is an interesting book.</p><p><strong><em>6. Sau giới từ: in, on, of, with, under, about, at……</em></strong></p><p>Ex: Thanh is good at literature.</p><p><span style=\"color:#800000\"><strong>II. Tính từ (adjectives)</strong></span></p><p>Tính từ thường đứng ở các vị trí sau</p><p><strong><em>1. Trước danh từ: Adj + N</em></strong></p><p>Ex: My Tam is a famous singer.</p><p><em><strong>2. Sau động từ liên kết: tobe/seem/appear/feel/taste/look/keep/get + adj</strong></em></p><p>Ex: She is beautiful</p><p>Tom seems tired now.</p><p><u>Chú ý</u>: cấu trúc keep/make + O + adj</p><p>Ex: He makes me happy</p><p><strong><em>3. Sau “ too”: S + tobe/seem/look….+ too +adj…</em></strong></p><p>Ex: He is too short to play basketball.</p><p><strong><em>4. Trước “enough”: S + tobe + adj + enough…</em></strong></p><p>Ex: She is tall enough to play volleyball.</p><p><strong><em>5. Trong cấu trúc so…that: tobe/seem/look/feel…..+ so + adj + that</em></strong></p><p>Ex: The weather was so bad that we decided to stay at home</p><p><em><strong>6. Tính từ còn được dùng dưới các dạng so sánh (lưu ý tính từ dài hay đứng sau more, the most, less, as….as)</strong></em></p><p>Ex: Meat is more expensive than fish.</p><p>Huyen is the most intelligent student in my class</p><p><strong><em>7. Tính từ trong câu cảm thán: How +adj + S + V</em></strong></p><p>What + (a/an) + adj + N</p><p><span style=\"color:#800000\"><strong>III. <u>Trạng từ (adverbs)</u></strong></span></p><p>Trạng từ thường đứng ở các vị trí sau</p><p><em><strong>1. Trước động từ thường (nhất là các trạng từ chỉ tàn suất: often, always, usually, seldom….)</strong></em></p><p>Ex: They often get up at 6am.</p><p><strong><em>2. Giữa trợ động từ và động từ thường</em></strong></p><p>Ex: I have recently finished my homework.</p><p><strong><em>3. Sau động từ tobe/seem/look…và trước tính từ: tobe/feel/look… + adv + adj</em></strong></p><p>Ex: She is very nice.</p><p><strong><em>4. Sau “too”: V(thường) + too + adv</em></strong></p><p>Ex: The teacher speaks too quickly.</p><p><em><strong>5. Trước “enough” : V(thường) + adv + enough</strong></em></p><p>Ex: The teacher speaks slowly enough for us to understand.</p><p><strong><em>6. Trong cấu trúc so….that: V(thường) + so + adv + that</em></strong></p><p>Ex: Jack drove so fast that he caused an accident.</p><p><strong><em>7. Đứng cuối câu</em></strong></p><p>Ex: The doctor told me to breathe in slowly.</p><p><strong><em>8. Trạng từ cũng thường đứng một mình ở đầu câu,hoặc giữa câu và cách các thành phần khác của câu bằng dấu phẩy(,)</em></strong></p><p>Ex: Last summer I came back my home country</p><p>My parents had gone to bed when I got home.</p><p>It’s raining hard. Tom, however, goes to school.</p><p><span style=\"color:#800000\"><strong>IV. <u>Động từ (verbs)</u></strong></span></p><p>Vị trí của động từ trong câu rất dễ nhận biết vì nó thường đứng sau chủ ngữ (Nhớ cẩn thận với câu có nhiều mệnh đề).</p><p>Ex: My family has five people.</p><p>I believe her because she always tells the truth.</p><p>Chú ý: Khi dùng động từ nhớ lưu ý thì của nó để chia cho đúng.</p><p><span style=\"color:#006600\"><sup><strong><span style=\"font-family:arial,helvetica,sans-serif\"><span style=\"font-size:14px\">CÁCH NHẬN BIẾT TỪ LOẠI DỰA VÀO CẤU TẠO TỪ</span></span></strong></sup></span></p><p><span style=\"color:#800000\"><strong>I. <u>Danh từ (nouns)</u></strong></span></p><p>danh từ thường kết thúc bằng: -tion/-ation, -ment, -er, -or, -ant, -ing, -age, -ship, -ism, -ity, -ness</p><p>Ex: distribution, information, development, teacher, actor, accountant, teaching, studying, teenage, friendship, relationship, shoolarship, socialism, ability, sadness, happiness…</p><p><span style=\"color:#800000\"><strong>II. <u>Tính từ (adjective)</u></strong></span></p><p>Tính từ thường kết thúc bằng: -ful, -less, -ly, -al, -ble, -ive, -ous, -ish, -y, -like, -ic, -ed, -ing</p><p>Ex: helful, beautiful, useful, homeless, childless, friendly, yearly, daily, national, international, acceptable, impossible, active, passive, attractive, famous, serious, dangerous, childish, selfish, foolish, rainy, cloudy, snowy, sandy, foggy, healthy, sympathy, childlike, specific, scientific, interested, bored, tired, interesting, boring</p><p><span style=\"color:#800000\"><strong>III. <u>Trạng từ (adverbs)</u></strong></span></p><p>-Trạng từ thường được thành lập bằng cách thêm đuôi “ly” vào tính từ</p><p>Ex: beautifully, usefully, carefully, bly, badly</p><p>– Những từ vừa là adjective vừa là adverb:</p><p>Ex: wrong, long, late, last, kindly, hard, free, fast, daily, best, all day, early, well.</p></div>",
    "page": 3
  },
  {
    "id": 52,
    "title": "Các cụm từ hữu ích dùng để viết lại câu",
    "a_href": "https://tienganhtflat.com/blog/cac-cum-tu-huu-ich-dung-de-viet-lai-cau",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/woman-7921621920-675x400-2e8c952ff6-9c09d04182c6b4e0f2760460ecdda22f.jpg",
    "viewer": "13,711",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p>1. to prefer doing sth to doing sth = would rather do sth than do sth = S + like sth/doing sth better than sth/doing sth:thích làm gì hơn làm gì<br/>\n2. to look at (v)= to have a look at (n):    nhìn vào<br/>\n3. to think about = to give thought to : nghĩ về<br/>\n4. it’s one’s duty to do sth = S + be + supposed to do sth: có nghĩa vụ làm gì<br/>\n5. to be determined to= to have a determination to : dự định<br/>\n6. to know (about) = to have knowledge of: biết<br/>\n7. to be not worth doing sth = there is no point in doing sth : không đáng, vô ích làm gì<br/>\n8. to tend to = to have a tendency to : có khuynh hướng<br/>\n9. to intend to +inf = to have intention of + V_ing : dự định<br/>\n10. to desire to = have a desire to : khao khát, mong muốn<br/>\n11. to succeed in doing sth = manage to do sth: làm việc gì thành công<br/>\n12. to wish = to have a wish / to express a wish : ao ước<br/>\n13. to visit Sb = to pay a visit to Sb / to pay Sb a visit : thăm viếng<br/>\n14. to discuss Sth = to have a discussion about : thảo luận<br/>\n15. can = tobe able to = to be possible: có thể làm gì<br/>\n16. to decide to = to make a decision to : quyết định<br/>\n17. to talk to = to have a talk with : nói chuyện<br/>\n18. understand = to be aware of: hiểu, nhận thức<br/>\n19. to explain Sth = to give an explanation for : giải thích<br/>\n20.to call Sb = to give Sb a call : gọi điện cho…<br/>\n21. to be interested in = to have interest in : thích<br/>\n22. because + clause = because of + N: bởi vì<br/>\n23. to drink = to have a drink : uống<br/>\n24. it seems that = it appears that = it is likely that = it look as if/ as though: dường như, có vẻ như<br/>\n25. to photograph = to have a photograph of : chụp hình<br/>\n26. to cry = to give a cry : khóc kêu<br/>\n27. to laugh at = to give a laugh at : cười nhạo<br/>\n28. like = to be interested in = enjoy = keen on = fond of sth: yêu thích cái gì<br/>\n29. to welcome Sb = to give Sb a welcome : chào đón<br/>\n30. to kiss Sb = to give Sb a kiss : hôn<br/>\n31. S + often + V = S + be used to +Ving /N = S + be accustomed to + Ving: thường/quen với làm gì<br/>\n32. to ring Sb = to give Sb a ring : gọi điện<br/>\n33. to warn = to give warning : báo động, cảnh báo<br/>\n34. although + clause = despite + N = in spite of + N: mặc dù, bất chấp<br/>\n35. to try to (+inf) = to make an effort to/ to make an attempt to : cố gắng<br/>\n36. to meet Sb = to have a meeting with Sb : gặp ai</p><p><img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/tat-tan-tat-ve-paraphrase-03.jpg?1478075009936\"/></p><p><u><strong>Một số ví dụ trong câu:</strong></u></p><p><strong>* Understand = to be aware of</strong></p><p>Do you understand the grammar structure? = Are you aware of the grammar structure?</p><p> ( Bạn có hiểu cấu trúc ngữ pháp không?)</p><p><strong>* Like = to be interested in = enjoy = keen on = fond of sth</strong></p><p>I like collecting stamps = I am interested in collecting stamps = I bcollecting stamps = I am keen on collecting stamps = I’m fond of collecting stamps.</p><p> ( Tôi yêu thích việc sưu tầm tem)</p><p><strong>* Because + clause = because of + N</strong></p><p>He can’t move because his leg was broken = He can’t move because of his broken leg</p><p> (Anh ấy không thể di chuyển vì chân anh ấy bị gãy = Anh ấy không thể di chuyển vì cái chân gãy.)</p><p><strong>* Although + clause = despite + N = in spite of + N</strong></p><p>bshe is old, she can compute very fast = Despite/In spite of her old age, she can compute very fast.</p><p> (Mặc dù đã nhiều tuổi, nhưng bà ấy có thể tính toán rất nhanh.)</p><p><strong>* Succeed in doing sth = manage to do sth</strong></p><p>We succeeded in digging the Panama canal = We managed to dig the Panama canal</p><p> (Chúng tôi đã thành công trong việc đào kênh Panama.)</p><p><strong>* To be not worth doing sth = there is no point in doing sth</strong></p><p>It’s not worth making him get up early = There is no point in making him getting early</p><p> (Gọi anh ấy dậy sớm không có ích gì đâu.)</p><p><strong>* It seems that = it appears that = it is likely that = it looks as if/ as though</strong></p><p>It seems that he will come late = It appears that / it is likely he will come late = He is likely to come late = It looks as if he will come late</p></div>",
    "page": 3
  },
  {
    "id": 53,
    "title": "Lời nói trực tiếp và gián tiếp (Dicrect and Indirect Speeches)",
    "a_href": "https://tienganhtflat.com/blog/loi-noi-truc-tiep-va-gian-tiep-dicrect-and-indirect-speeches",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/shada-wentz-928d912ac4-18770f97f844182c823fa20314bc59b1.jpg",
    "viewer": "7,641",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p>         <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/direct-indirect-speech.jpg?1478144394366\"/></p><p><span style=\"color:#800000\"><span style=\"font-size:14px\"><strong>1 - Những thay đổi trong lời nói Trực và Gián tiếp:</strong></span></span><br/><strong>1.1 Đổi thì của câu:</strong><br/>\nThì của các động từ trong lời nói gián tiếp thay đổi theo một nguyên tắc chung là lùi về quá khứ (các thì xuống cấp):</p><table border=\"1\" cellpadding=\"0\" cellspacing=\"0\" style=\"border-collapse:collapse\"><tbody><tr><td style=\"background-color:transparent; text-align:center\"><span style=\"color:#000066\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Thì trong Lời nói trực tiếp</strong></span></span></span></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#000066\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Thì trong Lời nói gián tiếp</strong></span></span></span></div></td></tr><tr><td style=\"background-color:transparent\"><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Hiện tại đơn</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Hiện tại tiếp diễn</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Hiện tại hoàn thành</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Hiện tại hoàn thành TD</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Quá khứ đơn</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Quá khứ hoàn thành</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Tương lai đơn</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Tương lai TD</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Is/am/are going to do</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Can/may/must do </span></span></div></td><td style=\"background-color:transparent\"><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Quá khứ đơn</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Quá khứ tiếp diễn</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Quá khứ hoàn thành</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Quá khứ hoàn thành TD</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Quá khứ hoàn thành</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Quá khứ hoàn thành (không đổi)</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Tương lai trong quá khứ</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Tương lai TD trong quá khứ </span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Was/were going to do</span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">- Could/might/had to do</span></span></div></td></tr></tbody></table><div> </div><div><span style=\"color:#000000\"><strong><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">* Hãy xem những ví dụ sau đây:</span></span></strong></span></div><table border=\"1\" cellpadding=\"0\" cellspacing=\"0\" style=\"border-collapse:collapse\"><tbody><tr><td style=\"background-color:transparent\"><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He does</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He is doing</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He has done </span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He has been doing</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He did</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He was doing</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He had done</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He will do</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He will be doing</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He will have done</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He may do</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He may be doing</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He can do</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He can have done</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He must do/have to do</span></span></span></div></td><td style=\"background-color:transparent\"><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He did</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He was doing</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He has done</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He had been doing</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He had done</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He had been doing</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He had done</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He would do</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He would be doing</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He would have done</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He might do </span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He might be doing</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He could do</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He could have done</span></span></span></div><div><span style=\"color:#A52A2A\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">He had to do</span></span></span></div></td></tr></tbody></table><div> </div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong><span style=\"color:black\">1.2 Các thay đổi khác:</span></strong></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong><em><span style=\"color:black\">a.</span></em></strong><span style=\"color:black\"> <strong><em>Thay đổi Đại từ</em></strong></span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Các đại từ nhân xưng và đại sở hữu khi chuyển từ lời nóitr ực tiếp sang lời nói gián tiếp thay đổi như bảng sau:</span></span></span></div><table border=\"1\" cellpadding=\"0\" cellspacing=\"0\" style=\"border-collapse:collapse\"><tbody><tr><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#000080\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>ĐẠI TỪ</strong></span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#000080\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>CHỨC NĂNG</strong></span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#000080\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>TRỰC TIẾP</strong></span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#000080\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>GIÁN TIẾP</strong></span></span></span></div></td></tr><tr><td rowspan=\"6\" style=\"background-color:transparent\"><div style=\"text-align: center;\"><strong><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">Đại từ</span></span></span></strong></div><div style=\"text-align: center;\"><strong><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">nhân xưng</span></span></span></strong></div></td><td rowspan=\"3\" style=\"background-color:transparent\"><div style=\"text-align: center;\"><strong><span style=\"color:#006400\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">Chủ ngữ</span></span></span></strong></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">I</span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#B22222\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">he, she</span></span></span></div></td></tr><tr><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">we</span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#B22222\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">they</span></span></span></div></td></tr><tr><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">you</span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#B22222\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">they</span></span></span></div></td></tr><tr><td rowspan=\"3\" style=\"background-color:transparent\"><div style=\"text-align: center;\"><strong><span style=\"color:#006400\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">Tân ngữ</span></span></span></strong></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">me</span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#B22222\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">him, her</span></span></span></div></td></tr><tr><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">us</span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#B22222\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">them</span></span></span></div></td></tr><tr><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">you</span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#B22222\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">them</span></span></span></div></td></tr><tr><td rowspan=\"6\" style=\"background-color:transparent\"><div style=\"text-align: center;\"><strong><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">Đại từ</span></span></span></strong></div><div style=\"text-align: center;\"><strong><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">sở hữu</span></span></span></strong></div></td><td rowspan=\"3\" style=\"background-color:transparent\"><div style=\"text-align: center;\"><strong><span style=\"color:#006400\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">Phẩm định</span></span></span></strong></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">my</span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#B22222\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">his, her</span></span></span></div></td></tr><tr><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">our</span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#B22222\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">their</span></span></span></div></td></tr><tr><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">your</span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#B22222\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">their</span></span></span></div></td></tr><tr><td rowspan=\"3\" style=\"background-color:transparent\"><div style=\"text-align: center;\"><strong><span style=\"color:#006400\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">Định danh</span></span></span></strong></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">mine</span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#B22222\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">his, her</span></span></span></div></td></tr><tr><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">ours</span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#B22222\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">theirs</span></span></span></div></td></tr><tr><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:#333333\">yours</span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#B22222\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\">theirs</span></span></span></div></td></tr></tbody></table><div> </div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Ngoài quy tắc chung về các thay đổi ở đại từ được nêu trên đây, người học cần chú ý đến các thay đổi khác liên quan đến vị trí tương đối của người đóng vai trò thuật lại trong các ví dụ sau đây:</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><u><span style=\"color:black\">Ví dụ:</span></u><span style=\"color:black\"> </span><span style=\"color:#000000\"><strong>Jane, \"Tom, you should listen to me.\"</strong></span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">+ Jane tự thuật lại lời của mình:</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><em><span style=\"color:black\">I told Tom that he should listen to me.</span></em></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">+ Người khác thuật lại lời nói của Jane</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><em><span style=\"color:black\">Jane told Tom that he should listen to her</span></em></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">+ Người khác thuật lại cho Tom nghe:</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><em><span style=\"color:black\">Jane told you that he should listen to her.</span></em></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">+ Tom thuật lại lời nói của Jane</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><em><span style=\"color:black\">Jane told me that I should listen to her.</span></em></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong><span style=\"color:black\">b.</span></strong><span style=\"color:black\"> <strong>Các thay đổi ở trạng từ không gian và thời gian:</strong></span></span></span></div><table border=\"1\" cellpadding=\"0\" cellspacing=\"0\" style=\"border-collapse:collapse\"><tbody><tr><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#000080\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Trực tiếp</strong></span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: center;\"><span style=\"color:#000080\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Gián tiếp</strong></span></span></span></div></td></tr><tr><td style=\"background-color:transparent\"><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>This</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>That </strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>These</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Here</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Now</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Today</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Ago</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Tomorrow</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>The day after tomorrow</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Yesterday</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>The day before yesterday</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Next week</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Last week</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Last year</strong></span></span></span></div></td><td style=\"background-color:transparent\"><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>That</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>That</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Those</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>There</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Then</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>That day</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Before</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>The next day / the following day</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>In two day’s time / two days after</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>The day before / the previous day</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>Two day before</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>The following week</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>The previous week / the week before</strong></span></span></span></div><div style=\"text-align: justify; line-height: 150%\"><span style=\"color:#800000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong>The previous year / the year before</strong></span></span></span></div></td></tr></tbody></table><div> </div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><u><span style=\"color:black\">Ví dụ:</span></u></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Trực tiếp: \"I saw the school-boy <em>here</em> in this room <em>today.\"</em></span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Gián tiếp: She said that she had seen the school-boy <em>there</em> in <em>that</em> room <em>that day</em>.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Trực tiếp: \"I will read <em>these </em>letters <em>now</em>.\"</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Gián tiếp: She said that she would read <em>those</em> letters <em>then</em>.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">   Ngoài quy tắc chung trên dây, người học cần chớ rằng <em>tình huống thật và thời gian khi hành động được thuật lại </em>đóng vai trò rất quan trọng trong khi chuyển từ lời nói trực tiếp sang lời nói gián tiếp.</span></span></span></div><div><span style=\"font-size:16px\"><span style=\"color:rgb(128, 0, 0)\"><span style=\"font-family:times new roman\"><strong>2- Câu hỏi trong lời nói gián tiếp:</strong></span></span></span></div><div><em><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\"> </span></span></span><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Câu hỏi trong lời nói gián tiếp được chia làm loại:</span></span></span></em></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong><u><span style=\"color:black\">2.1. Câu hỏi bắt đầu với các trợ động từ</span></u></strong><span style=\"color:black\">: Ta thêm</span><strong><span style=\"color:blue\"> </span><span style=\"color:#006400\">If/whether</span></strong></span></span></div><div><em><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><u><span style=\"color:black\">Ví dụ:</span></u></span></span></em></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Trực tiếp: \"Does John understand music?\" he asked.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Gián tiếp: He asked if/whether John understood music.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong><u><span style=\"color:black\">2.2. Câu hỏi bắt đầu who, whom, what, which, where, when, why, how</span></u></strong><span style=\"color:black\">: </span><span style=\"color:#006400\"><em>Các từ để hỏi trên sẽ được giữ nguyên trong câu gián tiếp:</em></span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Trực tiếp: \"What is your name?\" he asked.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Gián tiếp: He asked me what my name was.</span></span></span></div><div><strong><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><u><span style=\"color:black\">2.3. Các dạng đặc biệt của câu hỏi trong lời nói gián tiếp</span></u></span></span></strong></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong><em>a.</em></strong> <strong><em>Shall/ would dùng để diễn t ả đề nghi, lời mời:</em></strong></span></span></span></div><div><em><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><u><span style=\"color:black\">Ví dụ:</span></u></span></span></em></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Trực tiếp: \"Shall I bring you some tea?\" he asked.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Gián tiếp: He offered to bring me some tea.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Trực tiếp: \"Shall we meet at the theatre?\" he asked.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Gián tiếp: He suggested meeting at the theatre.</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong><em>b.</em></strong> <strong><em>Will/would dùng để diễn tả sự yêu cầu:</em></strong></span></span></span></div><div><em><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><u><span style=\"color:black\">Ví dụ:</span></u></span></span></em></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Trực tiếp: Will you help me, please?</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Gián tiếp: He ashed me to help him.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Trực tiếp: Will you lend me your dictionary?</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Gián tiếp: He asked me to lend him my dictionary.</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong><em>c.</em></strong> <strong><em>Câu mệnh lệnh và câu yêu cầu trong lời nói gián tiếp.</em></strong></span></span></span></div><div><em><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><u><span style=\"color:black\">Ví dụ:</span></u></span></span></em></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Trực tiếp: Go away!</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Gián tiếp: He told me/The boys to go away.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Trực tiếp: Listen to me, please.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Gián tiếp: He asked me to listen to him.</span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong><em>d.</em></strong> <strong><em>Câu cảm thán trong lời nói gián tiếp.</em></strong></span></span></span></div><div><em><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><u><span style=\"color:black\">Ví dụ:</span></u></span></span></em></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Trực tiếp: What a lovely dress!</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Tuỳ theo xúc cảm và hình thức diễn đạt, chúng ta có thể dùng nhiều hình thức khác nhau như sau:</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Gián tiếp: She exclaimed that the dress was lovely.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">She exclaimed that the dress was a lovely once.</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">She exclaimed with admiration at the sight of the dress. </span></span></span></div><div><span style=\"color:#000000\"><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><strong><em>e.</em></strong> <strong><em>Các hình thức hỗn hợp trong lời nói gián tiếp.</em></strong></span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Lời nói trực tiếp có thể bao gồm nhiều hình thức hỗn hợp: câu khẳng định, câu hỏi, câu mệnh lệnh, câu cảm thán:</span></span></span></div><div><em><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><u><span style=\"color:black\">Ví dụ:</span></u></span></span></em></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Trực tiếp: She said, \"can you play the piano?” and I said”no”</span></span></span></div><div><span style=\"font-size:14px\"><span style=\"font-family:times new roman\"><span style=\"color:black\">Gián tiếp: She asked me if could play the piano and I said that I could not.</span></span></span></div></div>",
    "page": 3
  },
  {
    "id": 54,
    "title": "Một số cụm từ trong tiếng Anh dễ bị nhầm lẫn",
    "a_href": "https://tienganhtflat.com/blog/mot-so-cum-tu-trong-tieng-anh-de-bi-nham-lan",
    "img_thumb": "https://tienganhtflat.com/cache/image/blog/4-a6a89d26b7-7b370017d05fc0efb28e67c0e587340b.jpg",
    "viewer": "3,081",
    "category": "blog-tieng-anh-can-ban",
    "detail_content": "<div class=\"content\"><hr/><p><span style=\"color:#800000\"><strong>1. In case of và in case:</strong></span></p><p><em>a. In case of + N (If there is/are )</em></p><p>Eg: In case of the rain, you should bring the umbrella with you.</p><p>(If there is a rain, you should bring the umbrella with you)</p><p><em>b. In case + S + V  (Because it may/might happen)</em></p><p>Eg: He took an umbrella in case it rained</p><p>(He took an unbrella because it might rain)</p><p><span style=\"color:#800000\"><strong>2. As a result và as a result of:</strong></span></p><p><span style=\"color:#800000\"><strong>                                      <img alt=\"\" src=\"http://tienganhtflat.com/uploads/image/grammar/cau%20truc%20va%20cum%20tu%20hya%20nham%20lan%20trong%20tieng%20anh%201.jpg?1478225400356\"/></strong></span></p><p><em>a. As a result (+ clause) = therefore</em></p><p>Eg: Bill had not been working very hard during the course. As a result, he failed the exams.</p><p>(Bill had not been working very hard during the course. Therefore, he failed the exams)</p><p><em>b. As a result of (+ noun phrase/Ving) = because of</em></p><p>Eg: Bill failed the exams as a result of his not having been working very hard during the course</p><p>(Bill failed the exams because of his not having been working very hard during the course)</p><p><span style=\"color:#800000\"><strong>3. Hardly / Scarely và no sooner: (với nghĩa ngay sau khi)</strong></span></p><p><em>a. Hardly/ Sccarely + auxiliary + S + V + when + clause 2</em></p><p>Eg: Hardly will he come when he wants to leave.</p><p><em>b. No sooner + auxiliary + S+ V + than + clause 2</em></p><p>Eg: No sooner does she earn some money than she spends it all.</p><p><span style=\"color:#800000\"><strong>4. Like doing something và would like to do something</strong></span></p><p><em>a. Like doing something</em>:</p><p>Ta dùng cấu trúc này để nói về một sở thích</p><p>Eg: I like playing guitar. = My hobby is playing guitar.</p><p><em>b. Would like to do something:</em></p><p>Ta dùng cấu trúc này để nói về sở thích nhất thời</p><p>Eg: I'd like to drink some coffee. = I want to drink some coffee now.</p><p><span style=\"color:#800000\"><strong>5. Not like to do something và not like doing something</strong></span></p><p><em>a. Not like to do something:</em></p><p>Ta dùng cấu trúc này để nói về một việc ta không thích và không làm</p><p>Eg: I don't like to go out with you.</p><p><em>b. Not like doing something:</em></p><p>Ta dùng cấu trúc này để nói đến một việc ta không thích nhưng vẫn phải làm</p><p>Eg: I don't like doing my homework.</p></div>",
    "page": 3
  }
]